[
    {
        "url": "https://www.indiatvnews.com/",
        "title": "Lashkar commander Saifullah, accused of several terror attacks in India, killed in Pakistan's Sindh",
        "content": "AWACS Strike Explained: How India's Operation Sindoor Crippled Pakistan's Air Defence Mayawati appoints nephew Akash Anand as BSP's new chief national coordinator | 18 May | Speed News 13 AAP councillors resign, form new party led by Mukesh Goel | 17 May | Speed News Centre Picks 7 MPs, Including Tharoor And Shinde, For Global Anti-Terror Mission From Military Deals to Student Exchanges: How India Is Distancing Itself from Turkey © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": ""
    },
    {
        "url": "https://www.indiatvnews.com/web-stories/sports/teams-to-suffer-group-stage-exits-as-defending-champions-in-ipl-2025-05-18-990817",
        "title": "Teams to suffer group stage exits as defending champions in IPL",
        "content": "IPL 2009: Rajasthan Royals IPL 2013: Kolkata Knight Riders IPL 2015: Kolkata Knight Riders IPL 2016: Mumbai Indians IPL 2018: Mumbai Indians IPL 2021: Mumbai Indians IPL 2022: Chennai Super Kings IPL 2024: Chennai Super Kings IPL 2025: Kolkata Knight Riders Next : Test legends with a worse career average than Virat Kohli",
        "timestamp": ""
    },
    {
        "url": "https://www.indiatvnews.com/sports/cricket/series/indian-premier-league/129413",
        "title": "IPL 2025",
        "content": "Gujarat Titans confirm spot in IPL 2025 playoffs after win over DC; RCB, PBKS officially qualify too Shubman Gill goes past Virat Kohli in major T20 record during DC vs GT IPL 2025 clash For first time in IPL history, KL Rahul achieves never-seen-before record in tournament during DC vs GT clash KL Rahul creates history, shatters Virat Kohli's all-time T20 record during DC vs GT IPL 2025 clash 5 players with most fours in T20 cricket, Babar Azam inches closer to Virat Kohli Top 5 run-scorers in IPL 2025 so far What is Noor Ahmad's salary in IPL 2025? Shreyas Iyer was subbed out for Harpreet Brar in the second innings in Punjab Kings' clash against Rajasthan Royals in IPL 2025. Shreyas has opened up on the reason behind the move after his team's 10-run win over RR in Jaipur. Rajasthan Royals registered an unwanted record as they lost their ninth game of the ongoing IPL (Indian Premier League) 2025. The side equalled the record previously held by Pune Warriors India in the tournament. With Lucknow Super Giants all set to take on Sunrisers Hyderabad in game 61 of the ongoing IPL (Indian Premier League) 2025, let us have a look at the head-to-head between both teams ahead of the upcoming game. Despite having made a rollicking start to their pursuit of 220, Rajasthan Royals bottled up another chase as they went down to Punjab Kings by 10 runs. PBKS have now kept a foot inside the playoffs with their eighth win of the season. Former India cricketer Sunil Gavaskar recently came forward and talked about how Shreyas Iyer did not get the credit he deserved for leading Kolkata Knight Riders to their third IPL (Indian Premier League) title in 2024. Kolkata Knight Riders' clash against Royal Challengers Bengaluru was washed out due to rain at the M.Chinnaswamy Stadium in Bengaluru. KKR have now been knocked out of the tournament, equalling an all-time unwanted record in the IPL history. Punjab Kings skipper Shreyas Iyer won the toss and opted to bat first in scorching Jaipur on Sunday, May 18, against the Rajasthan Royals. Punjab Kings need to win two out of their remaining three games to make it through to the playoffs. Former Australian captain Aaron Finch lashed out at Kolkata Knight Riders (KKR) team management for poor planning, which ultimately resulted in even worse execution and hence six losses. KKR were eliminated from IPL 2025 following the washout against RCB in Bengaluru. Former India cricketer Aakash Chopra took centre stage and talked about the replacement signings made by Rajasthan Royals as the side gears up to take Punjab Kings in game 59 of the ongoing IPL (Indian Premier League) 2025. Rajasthan Royals skipper Sanju Samson is all set to be available for his side's upcoming clash against Punjab Kings as the star batter has passed the fitness test. He will lead RR in their remaining games of the season. Delhi Capitals have had a season of two halves, first where they couldn't stop winning and the second where the wins came by very hard, just two in the last six. Gujarat Titans wouldn't be an easy opponent to face but if the Capitals have to make a late push, they will have to challenge top teams. Kolkata Knight Riders (KKR) had all of their overseas players returning for the remainder of IPL 2025, except Moeen Ali and Rovman Powell, after a week's suspension of the tournament. With the game in Bengaluru being washed out, KKR have just one match remaining in the season. Punjab Kings missed out on a couple of points in the abandoned Dharamsala clash against the Delhi Capitals last week, but will be keen to get them against the Rajasthan Royals in their adopted home ground in Jaipur for the remainder of the 2025 edition of the IPL. Delhi Capitals will host Gujarat Titans in match 60 of the ongoing IPL 2025. Both teams are in contention to qualify for the playoffs and a hard-hitting contest is expected at the Arun Jaitley Stadium on May 18. Gujarat Titans opener Sai Sudharsan had a terrific IPL 2025 campaign so far, smacking 509 runs in 11 innings. He is currently the second-leading run-scorer of the tournament. Ahead of the match against Delhi, he credited the shift in mindset for success. Rajasthan Royals will host Punjab Kings on May 18 at the Sawai Mansingh Stadium. RR are already out of the playoffs race but the game holds massive importance for Punjab, who are pushing for a spot in the top two in the points table. © 2009-2025 Independent News Service.  All rights reserved.",
        "timestamp": ""
    },
    {
        "url": "https://www.indiatvnews.com/news/india/shashi-tharoor-brushes-off-congress-snub-talk-over-foreign-delegation-invite-says-i-know-my-worth-2025-05-18-990838",
        "title": "Shashi Tharoor brushes off Congress snub talk over foreign delegation invite, says 'I know my worth'",
        "content": "Congress MP Shashi Tharoor has brushed off any political overtones in his decision to lead a multi-party delegation abroad for 'Operation Sindoor', saying, \"I see no politics in it.\" Tharoor, a former diplomat and one of Congress's most prominent international voices, confirmed on Saturday that he accepted the Centre's invitation to head a delegation aimed at countering Pakistan's narrative on terrorism without any hesitation. \"Union Parliamentary Affairs Minister Kiren Rijiju called me, and I agreed immediately,\" he told reporters, citing his prior experience in handling foreign affairs as a reason for the selection.  Tharoor dismissed concerns that his acceptance might have sparked discontent within the Congress, which had reportedly proposed other names for the delegation. Asked if the party was unhappy with his decision, Tharoor responded, \"You will have to ask them (Congress). I cannot be insulted so easily. I know my worth.\" The Thiruvananthapuram MP said that when the nation is in crisis, political differences should take a back seat. \"Politics becomes important only when we have a nation. We are all Indians first,\" he said, referencing the 88-hour standoff with Pakistan earlier this month. Tharoor added that when he initially received Rijiju's call, he had informed the party about it. \"I see no politics in it. National service is the duty of every citizen,\" he asserted, explaining that the central government sought his expertise as part of the national effort to counter Pakistan's influence globally. Meanwhile, Congress general secretary Jairam Ramesh added to the intrigue by stating that there is a difference between \"being in the Congress and of the Congress,\" hinting at possible internal discontent over Tharoor's decision. Ramesh said that the party had nominated former Union Minister Anand Sharma, Deputy Leader of the Lok Sabha Gaurav Gogoi, Rajya Sabha MP Syed Naseer Hussain, and Lok Sabha MP Raja Brar after the government asked for four names for the delegations. When asked about this apparent snub, Tharoor maintained that his role in the delegation was a matter of national duty. \"When the country is attacked, all of us speaking in one voice and standing united is good for the nation, according to me,\" he said. The central government has named Tharoor as the leader of one of the seven multi-party delegations tasked with projecting India's national consensus and resolute approach against terrorism on the global stage. The delegations are expected to visit key partner countries, including the US, UK, and Japan, to convey India's message of zero tolerance against terrorism. (With PTI inputs) © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-18T20:03:46+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/auto/maruti-suzuki-to-hike-car-prices-by-up-to-rs-62-000-from-april-8-2025-04-02-983582",
        "title": "Maruti Suzuki to hike car prices by up to Rs 62,000 from April 8",
        "content": "Maruti Suzuki India, the country's largest car manufacturer, has announced a price hike of up to Rs 62,000 across its passenger vehicle lineup, effective from April 8, 2025. The company cited rising input costs, operational expenses, regulatory changes, and feature additions as the primary reasons for the increase.  According to Maruti’s official statement, despite efforts to optimize costs, the company is compelled to pass on some of the rising expenses to customers. The price increase will affect several models across its Nexa and Arena dealerships.   Here’s a breakdown of how much more customers will have to pay for popular Maruti Suzuki models: This is not the first time Maruti Suzuki has raised prices in 2025. The company previously increased prices by up to 4% in January 2025. Automakers generally implement price hikes twice a year due to market conditions and rising costs.   Other leading carmakers, including Hyundai, Tata Motors, Mahindra & Mahindra, and Kia India, have also announced price increases for April 2025, indicating a broader industry-wide trend. Maruti Suzuki hikes prices of entire model range by 0.45 per cent 2024 Maruti Suzuki Swift to launch in May: What to expect 2024 Maruti Suzuki Swift launched in India: Check price, specifications, availability Attractive EMIs to buyback guarantees: Carmakers announce offers to woo customers this festive seaso Maruti Dzire 2024 achieves historic 5-star safety rating from Global NCAP | Check price, mileage Maruti Suzuki car prices to rise by up to 4 percent from January 2025  Maruti Suzuki sells its vehicles through two retail networks: ALSO READ:Honda Activa Electric launched with swappable battery ensures, you never run out of charge ALSO READ:Royal Enfield Classic 650 launched in India: Price, features and specs © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-04-02T18:31:07+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/sports/cricket/kl-rahul-creates-history-breaks-virat-kohls-all-time-t20-record-during-dc-vs-gt-ipl-2025-clash-2025-05-18-990843",
        "title": "KL Rahul creates history, shatters Virat Kohli's all-time T20 record during DC vs GT IPL 2025 clash",
        "content": "Delhi Capitals and India batter created history during DC'sIPL2025 clash against Gujarat Titans at theArun JaitleyStadium on Sunday, May 18. Rahul, who has been in impressive form in IPL 2025, shattered a historic record ofVirat Kohliin T20 cricket.  Rahul added another feather to his illustrious cap as he reached the mark of 8000 runs in T20 cricket. The 33-year-old has become the fastest Indian to get to the mark. He took only 224 innings to get to 8000 runs in the format, while Kohli had reached the mark in 243 outings. Rahul is the third-fastest to the mark overall, only behindChris Gayle(213 innings) andBabar Azam(218 innings). Fastest to 8000 runs in T20 cricket: 1 - Chris Gayle: 213 innings 2 - Babar Azam: 218 innings 3 -KL Rahul: 224 innings 4 - Virat Kohli: 243 innings 5 - Mohammad Rizwan: 244 innings Rahul needed only 33 runs to get to the 8000-run mark. He was sent to open alongsideFaf du Plessisas DC went with the seventh opening pair in the season. The opening has been a problem for the Capitals, who have slipped down in the points table after being the trendsetters earlier in the tournament. Rahul has been the in-form batter for DC. He brought up yet another fifty-plus knock during the clash, his fourth in the season. Meanwhile, GT captainShubman Gillhad won the toss and had opted to bowl first. \"We will bowl first. Not easy to start all over again, but good rest for our pacers, KG comes back, and that is a positive for us. We've had a good run, but we have three games and we're looking to win all of them. That's the thing with every match, we have to start fresh, our fielding hasn't been the best, but we've worked hard on it. We're hoping that everyone will come back and perform, looks like a good wicket, plenty of high scores, just one change, Rabada comes back,\"  Gill said at the toss. \"We too wanted to bowl first, but we'll now look to post a good total. We're taking one game at a time, not thinking too far ahead, not thinking too much about qualification, just taking it one at a time. I respect his personal decision (on Starc), but I want players to be 100% fit, just think about the plans. The same combination - three pacers and three spinners, Vipraj Nigam replaces Madhav Tiwari, Mustafizur replaces Starc,\" DC captain Axar Patel said at the toss. © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-18T20:23:04+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/technology/news/openai-launches-codex-new-tool-designed-to-assist-with-code-generation-understanding-2025-05-18-990816",
        "title": "OpenAI launches 'Codex', new tool designed to assist with code generation, understanding",
        "content": "OpenAI, a leading company in the artificial intelligence field, has provided countless enjoyable experiences for its millions of users. Recently, OpenAI unveiled a new tool designed to simplify the learning process for coding and engineering. This innovative AI tool, called 'Codex', has been seamlessly integrated with ChatGPT. As a cloud-based software engineering solution, Codex is particularly notable for its ability to handle numerous tasks at once. Specifically developed to streamline software development, 'Codex' was showcased during one of OpenAI’s live streams.  It is capable of performing a variety of functions, including bug fixing, providing technical information about the codebase, and implementation tasks. Built on OpenAI's o3 reasoning model, Codex follows a human-like coding style, continuously refining the code until it passes testing. Time estimates for task completion vary widely, with Codex typically taking between 1 and 30 minutes, depending on the task's complexity. The company emphasises that Codex's workflow is fully auditable, allowing users to track each step through terminal logs and test outcomes. It's crucial to understand that coding occurs in a distinct environment, with options to integrate the code into a local system or upload it directly to GitHub.   Using Codex is a straightforward process. OpenAI has integrated Codex into the sidebar of ChatGPT, where users can assign programming tasks. You simply need to choose \"Code\" with a prompt, and if you have questions about your codebase, you can click the Ask button for assistance. Each coding task is carried out in a dedicated cloud workspace, where all your code files are preloaded. Currently, Codex is available to users on subscription plans for ChatGPT. Specifically, it is accessible to users of the ChatGPT Pro, Enterprise, and Team plans. OpenAI has indicated that it plans to extend access to the ChatGPT Plus and Edu plans soon, but no specific date for this rollout has been provided yet. ALSO READ:Jio's 336-day and 200-day plans intensify competition with Airtel © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-18T17:19:28+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/video/kurukshetra",
        "title": "Kurukshetra",
        "content": "Coffee Par Kurukshetra: What is the motive behind the Pahalgam attack? Coffee Par Kurukshetra: Will Muslims make Modi win the Bihar elections now? Coffee Par Kurukshetra: Will Rahul Gandhi have to go to jail? Coffee Par Kurukshetra : Muslim alliance against Modi... What will they do till 5 May? Coffee Par Kurukshetra : Who cheated Muslims in the name of Waqf? Coffee Par Kurukshetra : Are Muslims getting free from the clutches of maulanas? Muqabla: Is there no one to save Hindus in Bengal? Coffee par Kurukshetra: Why are Hindus migrating in Bengal? Coffee Par Kurukshetra: Tahawwur Rana extradition, a victory for India Coffee Par Kurukshetra : Will Tahawwur Rana expose Pakistan? Coffee Par Kurukshetra: How did the Modi government succeed in bringing Tahawwur Rana to India? Coffee Par Kurukshetra : If a Muslim says 'Jai Shri Ram', will he be boycotted? Coffee Par Kurukshetra: Will Rahul snatch Muslim votes from Akhilesh Yadav? Coffee Par Kurukshetra: CM Yogi to reapeat again in 2027..Announced Amit Shah ? Coffee Par Kurukshetra : Will Muslims agree on the Wakf Amendment Bill? Coffee Par Kurukshetra : क्या वक्फ पर मोदी ने नंबर जुटा लिए ? Coffee Par Kurukshetra: Will Nitish Kumar become the Chief Minister again? Coffee Par Kurukshetra: How remarkable have Yogi Adityanath's 8 years been? Coffee Par Kurukshetra:  Do Muslims vote for Modi and support him? Coffee Par Kurukshetra: Can the police investigate a judge? Coffee Par Kurukshetra: Will Balochistan become an independent country? Coffee Par Kurukshetra: What is the use of notes in the judge's bungalow? Coffee Par Kurukshetra: Who is provoking Bhaijaan? Coffee Par Kurukshetra: Will Balochistan break away from Pakistan? Coffee Par Kurukshetra : Diplomat's biggest target…John will reveal who! Coffee Par Kurukshetra: Is Nepal going to become a Hindu nation again? © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": ""
    },
    {
        "url": "https://www.indiatvnews.com/gujarat/amit-shah-leads-tiranga-yatra-in-ahmedabad-to-mark-operation-sindoor-s-success-salutes-armed-forces-video-2025-05-18-990847",
        "title": "Amit Shah leads 'Tiranga Yatra' in Ahmedabad to mark Operation Sindoor's success, salutes Armed Forces | Video",
        "content": "Union Home Minister Amit Shah on Sunday led a 'Tiranga Yatra' in Sanand, Ahmedabad, to commemorate the success of Operation Sindoor, a swift and decisive military campaign launched in response to the Pahalgam terror attack on April 22. The march, organised by the Bharatiya Janata Party (BJP), drew hundreds of supporters, including local MLAs, BJP leaders, and residents, who walked from Nal Sarovar Chowkdi to Maharana Pratap Chowk, chanting patriotic slogans and paying tributes to the bravery of the armed forces.  Addressing the gathering, Shah said, \"The echoes of Operation Sindoor have reached every corner of the world. The Indian armed forces, backed by the unwavering resolve of Prime Minister Narendra Modi and precise intelligence, struck hard at Pakistan, shattering its claims of harboring no terrorists.\" He emphasised that the operation, which targeted key terror infrastructure in Pakistan, including nine strategic sites, has exposed the nexus between the Pakistani state and terrorist groups.   Shah also highlighted the symbolic significance of the operation's name, saying, \"The terrorists who shed innocent blood in Pahalgam have been wiped out, and the vermilion on the foreheads of India's mothers has been avenged.\" He warned that the focus would now shift to Pakistan-occupied Kashmir (PoK) and the complete dismantling of terror networks in the region. Referring to Pakistan's reliance on foreign defense systems, Shah claimed that the Chinese-made systems had failed to protect its military bases, while India's BrahMos missiles dominated the battlefield. \"Pakistan's defense systems, taken on loan from China, crumbled under the might of our forces,\" he said, adding that the operation would be remembered as a defining moment in India's counterterrorism history. Shah also used the occasion to push for environmental conservation, urging the youth to plant trees under the'Ek Pad, Maan Ke Naam' (One Tree in Mother's Name)campaign. He appealed to citizens to contribute to the ongoing Green Gandhinagar Mission, which aims to plant millions of trees across Gujarat to combat climate change. \"I call upon every young Indian to plant a tree in memory of their mother, repaying the debt to Mother Earth,\" he said. The Union Home Minister is on a two-day visit to Gujarat, during which he is expected to launch multiple development projects and meet with local leaders. The visit comes as the BJP steps up its outreach ahead of the 2025 state elections, looking to consolidate its support base amid rising political competition. © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-18T21:45:06+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/health/hypertension-at-work-practice-these-simple-lifestyle-changes-for-busy-professionals-to-stay-healthy-2025-05-17-990666",
        "title": "Hypertension at work? Practice these simple lifestyle changes for busy professionals to stay healthy",
        "content": "You’re running from one meeting to the next, eating lunch at your desk (if at all), and living off coffee just to stay sharp. Sounds familiar? You're not alone. A survey by the Indian Council of Medical Research (ICMR) (2022) revealed that nearly one in four working adults in India now lives with high blood pressure. What’s even more concerning is the fact that it often goes unnoticed and thereby undiagnosed.  Work stress, long sitting hours, and neglected self-care have turned hypertension into an invisible threat in modern work culture. The good news? A few conscious lifestyle changes can make a huge difference. According to Dr Sandeep K. Thakur, Senior Consultant, Internal Medicine, HCL Healthcare, Noida, hypertension doesn’t always come with flashing warning signs. There are no apparent symptoms for the same. Symptoms that do occur include occasional headache, a tired body, or a racing mind, all of which are easily brushed off as “normal” work exhaustion. But with time, untreated high blood pressure may affect your heart, kidneys, and brain. It blends in with your daily grind so smoothly that you might not even know it’s there until it becomes a serious threat to life. 1. Monitor your health matrix proactively —Just because you feel fine doesn’t mean everything is fine. Make it a habit to check your blood pressure and vitals regularly. One quick check can keep you a step ahead of problems. 2. Prevent nutritional gaps that can impact your health — Skipping meals or grabbing junk or fast food between Zoom calls impacts your health; you may not notice it now but will eventually start to notice. Keep easy snacks like fruits, chana, or nuts. A little prep now saves you from poor choices later. 3. Incorporate micro-movements into your routine — Even five minutes of standing, stretching, or walking can break the cycle of sitting and make a difference. Set a timer, get up, and monitor your physical activities. 4. Breathing exercise to reduce stress— Feeling overwhelmed? Hit pause. Close your eyes, inhale slowly, exhale even slower. Just three minutes of deep breathing can dial down stress and steady your blood pressure, and you don’t even need any app for such guidance. Managing hypertension doesn’t mean reconstructing your entire life. It’s all about being mindful about what you are eating, your physical activity, patterns of sleep and stress management. By gradually implementing manageable changes, you not only keep your blood pressure in check but also increase your energy and sense of control. Despite your efforts, if your blood pressure readings are persistently on the higher side, it's crucial to consult a doctor, preferably a specialist, who can provide a comprehensive diagnosis and treatment plan. Disclaimer: (Tips and suggestions mentioned in the article are for general information only and should not be construed as professional medical advice. Always consult your doctor or a dietician before starting any fitness programme or making any changes to your diet.) ALSO READ:World Hypertension Day: 5 essential steps to monitor and prevent high blood pressure in young adults © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-17T11:06:49+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/photos/fashion-lifestyle-5-easy-diy-ways-to-remove-tough-stains-from-clothes-2025-05-17-990679",
        "title": "5 easy DIY ways to remove tough stains from clothes",
        "content": "Rajnath Singh: IAF crushed Pak-backed terrorism in just 23 minutes from Bhuj | 16 May | Speed News Taliban Turns to India: A New Diplomatic Shift in the Wake of Pakistan's Tensions? Trump Takes U-Turn On His Statement About Helping Out In India-Pakistan Ceasefire From Akash to BrahMos: How Indian-Made Weapons Crushed Pakistan's Arsenal | Operation Sindoor How Does Bhargavastra Work, India's Latest Counter-Drone Weapon? Explained © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": ""
    },
    {
        "url": "https://www.indiatvnews.com/web-stories/sports/list-of-players-who-are-not-returning-to-ipl-2025-2025-05-17-990714",
        "title": "List of players who are not returning to IPL 2025 after resumption",
        "content": "Sam Curran of Chennai Super Kings Rovman Powell of Kolkata Knight Riders Nandre Burger of Rajasthan Royals Jake Fraser-McGurk of Delhi Capitals Jamie Overton of Chennai Super Kings Donovan Ferreira of Delhi Capitals Shamar Joseph of Lucknow Super Giants Rachin Ravindra of Chennai Super Kings Moeen Ali of Kolkata Knight Riders Wiaan Mulder of Sunrisers Hyderabad Jofra Archer of Rajasthan Royals Mitchell Starc of Delhi Capitals Nathan Ellis of Chennai Super Kings Next : Virat Kohli vs Hashim Amla - Stats comparison after 123 Test matches",
        "timestamp": ""
    },
    {
        "url": "https://www.indiatvnews.com/astrology/horoscope-today-may-13-sagittarius-to-get-better-results-know-about-other-zodiac-signs-2025-05-12-990046",
        "title": "Horoscope Today, May 13: Sagittarius to get better results, know about other zodiac signs",
        "content": "Today is the Pratipada date of Jyeshtha Krishna Paksha and Tuesday. The Pratipada date will remain till 12:36 pm tonight. Today, after crossing the whole day and night, Parigha Yoga will remain till 6:34 am tomorrow. Also, Visakha Nakshatra will remain till 9:09 am today, after which Anuradha Nakshatra will start. Apart from this, the month of Jyeshtha has started from today. Know from Acharya Indu Prakash how the day of May 13, 2025, will be for you and which measures you can take to make this day better. Also, know what will be the lucky number and lucky colour for you.  Today is going to be a special day for you. Today, you can make decisions on some important matters. You may be interested in religion and social work. Today, by giving any plan a thoughtful form, the goal will be achieved. You will be happy due to your increasing interest in religious activities. Today, you will get a chance to express your talent. The day of women of this zodiac who are doing business will be full of busyness. Today will be a devotional day for you. Lucky colour- pink Lucky number- 5 Today is going to be a good day for you. Taking some time out for your family and personal life today will bring sweetness to the relationship. If you get a business deal today, do not think too much about getting it. Because the results of the work done at the right time today will be favourable. There will be an atmosphere of happiness and peace at home. Misunderstandings of lovemates will be resolved, and closeness will increase. You will get a full chance to express your opinion in front of the family, people will be very impressed with your plan. Your financial side will be strong. Lucky colour- silverLucky number- 4 Today is going to be a golden day for you. There will be a relaxed and peaceful atmosphere at home due to solving the family problems going on for some time. Do not give unsolicited advice in the matter of others today. Have faith in your abilities. Spend some time with children from your busy day today. The ongoing discord in the partnership business will be resolved, and the mutual relationship will improve. Keep your patience today and go with the times. Keep your emotions under control, it will be beneficial. Your ability to deal with problems quickly will give you special recognition. Lucky colour- RedLucky number- 3 Today is going to be a good day for you. Stay busy with your work and do not take an interest in unnecessary activities. Today is a favourable day for you. If you want to take advantage of it, then remove old negative things from your mind. This will make you feel comfortable in making decisions. The day will be spent shopping for things related to family comforts. Students of this zodiac will be focused on their careers. The experience and support of senior members of the family will be very beneficial for you. You will get special good news from the children's side. The opposition will bow down to you. Lucky colour- BrownLucky number- 1 Today is going to be favourable for you. Today your work which was pending for a long time will be completed, which will make you happy. The work which was pending for a long time can be successful today with less hard work. Students will be fully focused on their studies. Spending some time in the company of a respected person will enhance your personality. You will make new targets for work. You will plan to visit a religious place with your family. Lucky colour- WhiteLucky number- 9 Today is a great day for you. If there was any rift between you and your siblings, it will be resolved. Today, your plans will be completed on time. By giving time to the family, the atmosphere of the house will remain pleasant. Today, you will complete your office work soon. Today you can plan to go to a function. Where you can meet a distant relative. Today, you will try to fulfil the needs of the children. Lovemates will plan to have dinner today. Lucky colour- BlueLucky number- 1 Today is going to be favourable for you. Today, you will have to work harder at the workplace; do not let your work capacity decrease. Today, the financial condition will improve due to getting the pending money. Today, there will be a discussion on a particular work with the staff and colleagues, which will be positive. Take expansion-related plans seriously. You will get answers to many complicated questions today, the confusion will end. Your married life is going to be good today. Lucky colour- GoldenLucky number- 7 Today will be a great day for you. Today, your circumstances will be more favourable than before. You will get more benefits from hard work in the business sector today. Today, you will get many opportunities for monetary gains. Today, you can plan a trip with friends. Today, you will be busy doing important office work. People trying to transfer will get the good news of transferring to their favourite place. You will be interested in the work. You will feel better by helping a stranger. Lucky colour- BrownLucky number- 6 Today is going to be a mixed day for you. Students will get better results from their hard work. There will be an atmosphere of happiness in married life. Today, children will help their mothers with household chores, due to which the mother happy with them. Today, you will be busy with religious activities. Also, you may get a chance to go to a religious ritual. Today, your financial position will be strong. Today, excessive expenses should be stopped. Students can complete their pending work. You will be fit in terms of health today. Lucky colour- PitchLucky number- 9 Today, your financial position will be strong. There are chances of profit in your business. You can also do a side business. Which will create a possibility of profit. For those who are interested in politics, there is a chance of getting a big post. Family relationships will be strengthened. Start a new work and you will be successful. You will be seen working for the welfare of the family with your life partner, and the blessings of the members will remain with you. Today, you will spend more time on social media. Lucky colour- BrownLucky Number- 6 Today is going to be a great day for you. Today, you will go for a job interview, in which you will be selected. Before starting a new business, take advice from an experienced person so that your business runs well. Library businessmen can make up their minds to open a new branch. You will understand each other well in married life. Today, you will take the advice of family members in your decision. Today, you will have to pay some attention to your health. Lovemates will be able to understand each other better today. Lucky colour- SilverLucky Number- 2 Today is going to be a good day for you. You should avoid interfering in anyone's affairs. If you are thinking of investing money in a big project, then first take advice from an experienced person. You are likely to get big financial benefits from any investment. You will visit a religious place. During this time, take care of your health. You will get opportunities for promotion or job change. You should make a decision wisely in job matters. Lucky colour- PinkLucky number- 1 (Acharya Indu Prakash is a well-known astrologer of the country, who has a long experience in Vastu, Samudrik Shastra and Jyotish Shastra. You can see him in Bhavishyavani every morning at 7:30 am on India TV.) © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-12T23:49:39+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/business/news/boycott-turkey-aiasl-other-ground-handling-firms-begin-onboarding-celebi-aviation-staff-at-indian-airports-turkish-firm-celebi-contract-cancelled-2025-05-17-990646",
        "title": "Boycott Turkey: AIASL, other ground handling firms begin onboarding Celebi Aviation staff at airports",
        "content": "Multiple ground handling companies, including state-owned Air India Air Transport Services Limited (AIASL), Bird Worldwide Flight Services and Indo Thai, are onboarding the staff of Celebi Airport Services India at various airports, and fresh airport entry passes are being issued, industry executives said on Friday (May 16). The civil aviation ministry said that arrangements have been made at all the affected airports to ensure seamless handling of passengers as well as cargo, just hours after the security clearance for Celebi was revoked on the grounds of national security on Thursday (May 15).  Civil Aviation Ministry also said that efforts were being made to ensure that employees working with Celebi are retained and continue to contribute. Celebi has more than 10,000 staff in India. The executives said AI Airport Services Ltd (AIASL), AISATS, Bird Worldwide Flight Services Pvt Ltd and Indo Thai Airport Management Services Pvt Ltd, among others, are onboarding the Celebi staff. The Airport Entry Passes (AEPs) were issued to the staff in the name of Celebi and now, fresh AEPs are being issued to them in the name of the company which has onboarded them, the executives added. The Bureau of Civil Aviation Security (BCAS) has set a deadline till May 19 for the issuance of the new AEPs. According to the executives, respective airport operators will soon be floating tenders to appoint ground-handling service providers at the affected airports. AIASL handles around 560 flights daily at around 85 airports in the country. The company has around 20,000 employees. Industry executives said AIASL has taken hundreds of Celebi staff and is working to ensure seamless ground handling services at some of the airports where Celebi used to provide the services. One of the executives said that AIASL might rope in staff from other airports to handle services at the Celebi-served airports in order to ensure that there are no disruptions. Mumbai airport operator MIAL on Friday (May 16) said Indo Thai Airport Services will be carrying out the ground handling works at the airport for three months. After terminating the concession agreement with Celebi, Delhi airport operator DIAL has given the works on the existing terms to a company which already has security clearance as a regulated agent to carry on cargo business at airports, according to a regulatory filing. The details about the company were not disclosed in the filing by GMR Airports Ltd (GAL). \"The above mentioned transaction is a related party transaction and is on an arm's length basis, and promoter/promoter group/group companies of the company do not have any interest in the said transaction, other than their indirect shareholding in both DIAL and GAL,\" the filing said. Why Celebi Aviation’s security clearance revoked and what are two entities that were operational? Adani Airport ends partnership with Turkish firm Celebi for Mumbai, Ahmedabad airports CAIT ends business relations, trade with Turkey and Azerbaijan for supporting Pakistan Bihar trade bodies call for boycott of Turkey, Azerbaijan and China over support to Pakistan Turkish firm Celebi explores legal remedies to challenge termination of pacts in India | Details  Meanwhile, Celebi Airport Services India Pvt Ltd on Friday moved the Delhi High Court against the decision of BCAS revoking its security clearance in the \"interest of national security\". The decision of BCAS came against the backdrop of Turkiye backing for Pakistan and its condemnation of India's recent strikes on terror camps in the neighbouring country and Pakistan-occupied Kashmir (PoK) under 'Operation Sindoor'. Pakistan had also used Turkish drones on a large scale in the military conflict with India. Following the BCAS move, Civil Aviation Minister K Rammohan Naidu, on Thursday (May 15), said national interest and public safety are paramount and non-negotiable. Meanwhile, Poonam Verma Sengupta, Partner at JSA Advocates and Solicitors, said the termination of arrangements with Celebi also reflects a broader policy decision, where India is prioritising self-defence and conducting a deeper scrutiny of foreign entities operating in sensitive infrastructure sectors. \"By reassessing these agreements, India is not only safeguarding its aviation market- it is also indicating that future access will be contingent upon strategic balance, commercial fairness, and national interests,\" Verma said. © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-17T07:26:43+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/astrology/horoscope-today-may-12-pisces-to-get-support-from-family-know-about-other-zodiac-signs-2025-05-11-989868",
        "title": "Horoscope Today, May 12: Pisces to get support from family, know about other zodiac signs",
        "content": "Today is the full moon date of Vaishakh Shukla Paksha and Monday. Purnima Tithi will remain till 10:26 pm tonight. Today, Variyaan Yoga will remain throughout the day and night till 5:53 am tomorrow. Also, Visakha Nakshatra will remain throughout the day and night till 9:09 am tomorrow. Apart from this, today is Vaishakhi Purnima. Know from Acharya Indu Prakash how the day of May 12, 2025, will be for you and which measures you can take to make this day better. Also, know what the lucky number and lucky colour will be for you.  Today, your day will be full of happiness. Today, you will be successful in fulfilling your responsibilities well, you will buy some new things for the house. Today, recognise your ability and strength and make proper use of time. Today, you will take an interest in personal work as well as work like improving the social system. Today, students will focus on their studies. Today, you will make up your mind to start a new business. If you are associated with art, then today you will get a chance to perform. Lucky colour- Maroon Lucky number- 4 Today will be a favourable day for you. Today, you will get the support of family members. Your friends will prove to be helpful. Today, your work will be appreciated in the office. Your efficiency will increase. By being alert today, you will solve problems quickly. If you take decisions with the mind rather than the heart in family or personal matters, then you will be able to reach better results. By spending some time on spiritual activities, your self-confidence will be strengthened. You will get an opportunity for a sudden monetary gain in business, which will keep your mind happy. Lucky colour- SilverLucky number- 7 Today will be a beneficial day for you. Today, your respect will increase. Doing every work thoughtfully will give you success. With the help of a friend, the entangled tasks will be solved. Today, you will feel very relaxed mentally. Today, your confidence will increase. You will get career success. Today, you should avoid postponing your work. It will be better to complete the work on time. You will go to a family function. Your confidence will remain high. Seniors in the workplace will be happy with your work. Lucky colour- BlueLucky number- 8 Today will be a good day for you. Spouse's advice and support will be beneficial for you. Today, the workload may be more, but the more effort you put into a task, the better the work will be done. Today, instead of paying attention to useless things, you will focus on yoga, meditation. Today, the opinion of an experienced person will prove better for you. You can be more emotional about your relationship with your spouse. Today is going to be a great day for students. There are chances of getting success. Lucky colour- GoldenLucky number- 1 Today, your day will start well. You will be successful in completing household work with the help of people around you. You will get the blessings of your parents. Today, there will be a lot of running around related to business. Some people will also try to confuse you. Keep your decision paramount. You can get a big order. Which will also benefit a lot. Today, you will make a new friend with whom you will have a long-term friendship. You will be given the responsibility of a new project in the office. Lucky colour- WhiteLucky number- 6 Today will be a good day for you. Today, you will get good opportunities for financial gain. You will benefit from travel. Today, you will achieve a difficult goal with hard work and effort. Do not trust everyone, and just focus on your work. Today, by introspection, you will experience mental and spiritual happiness and peace. Children will remain focused towards their studies. There will be mutual harmony among all the members of the family. You will establish new dimensions in your career. Lucky colour- MagentaLucky number- 1 Today has brought new happiness to your family. Your day will be spent with family members. Today, the meaningful results of your hard work and efforts will come out. You will interact with some special people, and a plan will be made for some auspicious work. The time is very favourable to start something new. Financial condition will improve due to receiving the pending payment. You will plan to go out with friends. You will be successful in making an impact on others, but you need to control your anger. Your ideas will be respected. Lucky colour- PurpleLucky number- 9 Today will be a profitable day for you. Today, your passion for work will make you achieve success, but before making a big deal, do a thorough investigation. Family relationships will be strengthened. You will get good news from the children's side. Today, new ideas will come to your mind in business matters. Today, you will get relief by getting a solution to a problem. Your work will be appreciated. Lovemates will go for dinner today, and sweetness in relationships will increase. Lucky colour- YellowLucky number- 7 Today is going to be a great day for you. Work at the workplace will be done better than usual. Today, your spouse will praise you a lot. Today, you will discuss a particular decision with your parents, and with the advice of an experienced person, it will also be resolved. Before making a promise to anyone, do proper thinking. Today, you will also focus on saving by controlling unnecessary expenses. The atmosphere of the house will remain pleasant due to the arrival of guests in the evening. You will feel healthy. Lucky colour- PeachLucky number- 4 Today will be favourable for you. Today, your wishes will be fulfilled. Today, by being cautious about any work, you can avoid many problems. Today, you will achieve success with your hard work and ability. Work will also start on a new plan. You may have to travel abroad in connection with business, which will be very beneficial for you. Your happiness will increase. You are likely to get a responsible job in the office, which will be beneficial on completion. There will be a pleasant atmosphere in the family. Health will be better than before. Lucky colour- GreenLucky number- 8 Today your day will be full of happiness. Today your office colleagues will cooperate in your work, your work will be completed quickly. Today, while taking important decisions, keep your budget in mind, because the situation of expenses seems to be increasing. Today you will participate in social work with great enthusiasm. Youth need to be more alert towards their studies and career. Your planned work will be completed easily. You will be successful in creating harmony among family relationships. Lucky colour- BlackLucky number- 9 Today, your day will start with new enthusiasm. You will get the support of family members in doing family work. One should avoid sharing personal problems with a stranger. You will discuss with family members to improve the standard of living, as well as new information will be received through media or contact sources, which will prove beneficial. A solution to any problem that has been going on for some time can be found today. You can think about investing money in a new business, but do not forget to take advice from an expert. Lucky colour- OrangeLucky number- 4 (Acharya Indu Prakash is a well-known astrologer of the country, who has a long experience in Vastu, Samudrik Shastra and Astrology. You can see him every morning at 7:30 am in Bhavishyavani on India TV.) © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-11T22:52:45+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/health/drinking-white-pumpkin-juice-on-an-empty-stomach-can-help-cure-these-5-health-problems-2025-05-17-990651",
        "title": "Drinking white pumpkin juice on an empty stomach can help cure these 5 health problems",
        "content": "White pumpkin or ash gourd is very beneficial for our health. It is also known as white petha or round gourd. White pumpkin is rich in nutrients, as it contains many nutrients like protein, fibre, zinc, iron, calcium, magnesium and phosphorus, which provide many benefits to health. It is consumed in many ways, as some people eat it by making its vegetable, while some people like to eat it by making pudding. But have you ever drunk white pumpkin juice? Yes, white pumpkin juice is very beneficial for health. Consuming it on an empty stomach in the morning can give many health benefits. It can prove beneficial, from improving the digestive system to losing weight. So let's know in detail about the benefits of drinking white pumpkin juice on an empty stomach in the morning.  Consuming white pumpkin juice on an empty stomach in the morning helps in keeping the digestive system healthy. Actually, it contains plenty of fibre, which helps in improving digestion. Its regular consumption can provide relief from problems like gas, bloating, constipation and acidity. Consuming white pumpkin juice on an empty stomach in the morning can help in weight loss. Actually, it is very low in calories and rich in fibre, which helps in reducing weight. By consuming it, the stomach remains full for a long time, and you can help avoid overeating. This makes weight loss easier. Drinking white pumpkin juice on an empty stomach in the morning can boost immunity. Actually, it contains plenty of vitamin C and antioxidants, which help in boosting immunity. Drinking this juice can avoid falling prey to many diseases and infections. Consuming white pumpkin juice on an empty stomach in the morning can help detox the body. By consuming it, the toxins accumulated in the body are eliminated. Consuming it regularly can prevent many serious diseases. Consuming white pumpkin juice on an empty stomach in the morning can prove beneficial for heart health. Actually, it helps in controlling high blood pressure and high cholesterol. This healthy juice can help reduce the risk of heart diseases. Disclaimer: (Tips and suggestions mentioned in the article are for general information only and should not be construed as professional medical advice. Always consult your doctor or a dietician before starting any fitness programme or making any changes to your diet.) © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-17T08:13:54+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/sports/cricket/lsg-vs-srh-head-to-head-record-ahead-of-ipl-2025-match-61-2025-05-18-990836",
        "title": "LSG vs SRH head to head record ahead of IPL 2025 Match 61",
        "content": "The stage is set for game 61 of the ongoingIPL(Indian Premier League) 2025. Lucknow Super Giants will be taking on Sunrisers Hyderabad at the Ekana Stadium in Lucknow on May 19. Both sides will be hoping to put in a good performance in the upcoming game.  Currently, Sunrisers Hyderabad occupy eighth place in the standings. With 11 matches played, the side has won three matches, lost seven, and one game has produced no result. On the other hand, Lucknow Super Giants sit in seventh place in the standings. The side is still mathematically in the race for the playoffs. With 11 matches played, the side has won five games, lost six, and one game has produced no result. With SRH already eliminated, the side will be hoping for a consolation win. On the other hand, despite having a low chance to qualify, Lucknow Super Giants will be hoping to move further up in the standings and stay in the race to qualify for the knockouts. LSG vs SRH head-to-head record in IPL Both Lucknow Super Giants and Sunrisers Hyderabad have taken on each other in the IPL 4 times. Lucknow Super Giants have won the tie 3 times, whereas Sunrisers Hyderabad have won the clash 1 time. Punjab Kings create history in IPL, register multiple huge records with bat during clash against RR Sunil Gavaskar makes big statement on Shreyas Iyer's captaincy for PBKS Rajasthan Royals bottle up another chase as Punjab Kings put one foot inside IPL 2025 playoffs  LSG IPL 2025 squad:Rishabh Pant, David Miller,Aiden Markram, Aryan Juyal, Himmat Singh, Matthew Breetzke, Nicholas Pooran, Mitchell Marsh, Abdul Samad, Shahbaz Ahamad, Yuvraj Chaudhary, Rajvardhan Hangargekar, Arshin Kulkarni, Ayudh Badoni, Avesh Khan, Akash Deep, M. Siddharth, Digvesh Singh, Akash Singh, Shamar Joseph, Prince Yadav, Mayank Yadav, Mohsin Khan, Ravi Bishnoi. SRH IPL 2025 squad:Ishan Kishan, Atharva Taide, Abhinav Manohar, Aniket Verma, Sachin Baby,Heinrich Klaasen, Travis Head, Harshal Patel, Kamindu Mendis, Wiaan Mulder, Abhishek Sharma,Nitish KumarReddy,Pat Cummins, Mohammad Shami, Rahul Chahar,Adam Zampa, Simarjeet Singh, Zeeshan Ansari, Jaydev Unadkar, Eshan Malinga. © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-18T19:36:58+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/web-stories",
        "title": "web stories",
        "content": "How can DC, MI and LSG qualify for IPL 2025 playoffs? Teams to suffer group stage exits as defending champions in IPL Test legends with a worse career average than Virat Kohli Indian players with most Test centuries in SENA countries A look at real-life mother-daughter duos who made their mark in Bollywood Ae Watan to Mitti, 7 iconic songs from India-Pakistan war film 8 must-watch family dramas on Prime Video 5 actors who played real-life army roles on screen List of countries with nuclear weapons | Check here What happens if nuclear weapons are used? What is the punishment for 'illegal' alarm chain pulling in trains? Which is the cleanest village in world? MIVI SuperPods Concerto: Quick Review Samsung Galaxy S24FE gets Rs 35,000 discount: Here's where to buy Android's Massive UI Redesign in the Works: First Look Here iPhone 16 Plus gets Rs 40,000 discount, now available for Rs 57,999: Here's where to buy World Whiskey Day: 5 homemade whiskeys to enjoy this weekend Indian apple vs Turkey apple: What are the key differences? Watermelon juice vs Sugarcane juice: Which drink is more hydrating in summers? 5 countries to visit instead of Turkey and Azerbaijan to get the Mediterranean vibe 5 Ayurvedic medicinal leaves to lower uric acid levels 5 home remedies to cure food poisoning 5 home remedies to get relief from gas and acidity in morning 5 drinks that help detox your liver LIC Mutual Fund re-introduces these five flagship equity schemes - Full details here Rs 265 Dividend Stock: Software firm announces highest payout - Check record date BHIM 3.0: From splitting expenses to tracking monthly expenditure - Here are some key features Dividend Stocks: Bajaj Finance to Varun Beverages, these shares to trade ex-date this week - Full list Horoscope Today, March 17: Big benefits for Geminis in government work, know about other zodiac signs Horoscope Today, March 3: Libra to get benefit in ancestral property, know about other zodiac signs Horoscope Today, February 20: Lucky day for Taurus students, know about other zodiac signs Horoscope Today, February 9: Financial problems to solve for Libra, know about other zodiac signs © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": ""
    },
    {
        "url": "https://www.indiatvnews.com/entertainment/news/ananya-panday-ishaan-khatter-named-in-forbes-30-under-30-asia-2025-list-2025-05-18-990830",
        "title": "Ananya Panday, Ishaan Khatter named in Forbes 30 Under 30 Asia 2025 list",
        "content": "Bollywood actorsAnanya Pandayand Ishaan Khatter have been featured in the Forbes 30 Under 30 Asia list this year. For the unversed, every year, Forbes magazine releases the Forbes 30 Under 30 list, which consists of 30 notable people under 30 years old in various industries, including young achievers, entrepreneurs, innovators and leaders.  The list quotes Ananya as saying, \"Ananya Panday made her Bollywood acting debut in 2019 in the romantic comedy \"Student of the Year 2.\" Since then, she's appeared in 11 films, including \"CTRL,\" a Hindi-language thriller shown on Netflix. In April, Panday was named Chanel's first Indian brand ambassador, a milestone for the luxury brand's expansion in South Asia. The daughter of actor Chunky Panday, she has 26 million followers on Instagram.\" Ananya Panday shared this news on her Instagram handle with a caption, \"Thank you @forbesasia @forbes for the #Forbes30Under30 Asia.\" Have a look at the post below:   Another Indian name from the film industry in the 'Entertainment and Sports' category of the 'Forbes 30 Under 30 Asia' list includes Ishaan Khatter. The citation of The Royals actor Ishaan Khatter reads, \"Ishaan Khatter is on the verge of becoming an A-lister both in Bollywood and Hollywood. For his first film, the indie Hindi drama 'Beyond the Clouds,' Khatter won Filmfare Awards' Best Male Debut in 2019 and the India International Film Academy's Best Male Debut award. Khatter moved on to star in 'A Suitable Boy' (2020) on Netflix and last year acted alongside superstar Nicole Kidman in 'The Perfect Couple.\" Talking about the work fronts of these actors, Ananya Panday was last seen in 'Kesari Chapter 2: The Untold Story of Jallianwala Bagh' alongsideAkshay Kumarand R Madhavan in the lead roles. On the other hand, Ishaan Khatter was last seen in Netflix's romantic comedy 'The Royals' co-starring Bhumi Pednekar,  Nora Fatehi, Lisa Mishra, and Mismatched fame Vihaan Samat in the lead roles. Also Read:Akshay Kumar wraps up shoot for upcoming horror comedy 'Bhooth Bangla', shares video | WATCH  © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-18T19:09:10+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/education/exam-results/himachal-hpbose-class-12th-board-examination-2025-result-declared-check-pass-percentage-topper-s-name-direct-link-other-details-2025-05-17-990690",
        "title": "Himachal HPBOSE class 12th result declared with 83.16% pass percentage | Check topper's name, other details",
        "content": "The Himachal Pradesh Board of School Education (HPBOSE)  officially announced the Class 12 results on Saturday. According to the results, the overall pass percentage stands at 83.16 per cent. Candidates who appeared for the exam can now check their results on the official website — hpbose.org. To access their scores, students will need to enter their roll number as mentioned on their admit cards. However, the original mark sheets will be available only through their respective schools, and students are advised to collect them from there.  As per the results, this year's top 10 merit list features a total of 75 students, out of which a remarkable 61 are girls and 14 are boys -- once again showcasing the strong performance of female students in the state. Leading from the front is Mehak from Una district, who has clinched the top position across Himachal Pradesh. Apart from the official website, students can also check their results on digilocker.gov.in. It is to be noted that the class 12th board examination was conducted at 2,300 exam centres across the state, in which more than 93,000 students (both regular and SOS) had appeared.  ALSO READ:CBSE Class 10th result 2025 declared, 93.66 per cent pass exams, girls outperform boys: Direct link here © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-17T13:18:11+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/sports/cricket/why-was-pbks-captain-shreyas-iyer-subbed-out-in-team-clash-against-rr-in-ipl-2025-skipper-reveals-2025-05-18-990839",
        "title": "Why was PBKS captain Shreyas Iyer subbed out in team's clash against RR in IPL 2025? Skipper reveals",
        "content": "Shreyas Iyer was subbed out in Punjab Kings' second innings in the clash against Rajasthan Royals on Sunday, May 18. After the Kings racked up 219/5 at the Sawai Mansingh Stadium, Shreyas did not take the field as Shashank Singh led the team as stand-in captain.  Speculations were raised after Shreyas was subbed out for Harpreet Brar. The PBKS skipper has revealed the reason why he got subbed out in the second essay, stating that his finger is injured. \"The reason is the finger over here (pointing at his forefinger). I don't know what has happened. Yesterday while practising I got hit, I will have to go and check what is the issue here,\" Shreyas said after his team's 10-run win over Rajasthan. Despite being subbed out, Shreyas kept passing messages and helped the stand-in captain Shashank make decisions. \"I was just passing on the message to all the players to keep a positive body language, you tend to drop and feel the game has gone away from you, but I am proud of every player out there for showing that sort of great and bold approach,\" he said. Where most of the bowlers went to cleaners, Harpreet put up a bowling masterclass with his match-winning spell of 3/22 in his four overs. Speaking on Harpreet, Shreyas said, \"he has been consistent in the nets. He wants to do the best for himself, he was hungry for this opportunity and today I feel he stepped in and delivered at his best, congratulations to him and his mindset has been tremendous throughout.\" \"Absolutely brilliant approach and attitude coming in after the break, the boys were in high spirits and we also needed a rest, going forward in the tournament, it was the right time we came in together and showed the kind of mindset to win irrespective of the situation. Going forward we saw that the spinners were difficult to take charge over, we hardly got runs off their spinners and that's one learning, apart from that we can change the game from any situation,\" Shreyas added after the win. © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-18T20:05:59+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/cms/advertise",
        "title": "Advertise",
        "content": "India TV offers an amalgamation of facts,news and views to reach out the consumers across the entire gamut of products and services in India. In a short span of time, India TV has gained significant ground in delivering news to the audiences across the globe. A list of our valued advertisers can be supplied on request at the discretion of India TV News for our valued partners. India TV has retained mutually beneficial relationships with some of India's most respected corporate houses. Interested corporate's can explore this bright avenue.You can reach us atadsales@indiatvnews.com We offer a wide variety of advertising and digital solutions to highlight your message to the right audience at the right time. \n                            For inquiries, please contact - Email:digitalsales@indiatvnews.com © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": ""
    },
    {
        "url": "https://www.indiatvnews.com/news/world/israel-launches-extensive-new-ground-operations-in-gaza-strip-as-air-strikes-kill-at-least-103-people-2025-05-18-990854",
        "title": "Israel launches extensive new ground operations in Gaza Strip as air strikes kill at least 103 people",
        "content": "Israel on Saturday launched extensive” new ground operations in the Gaza Strip as airstrikes in a new offensive killed at least 103 people, including dozens of children, overnight and into Sunday, hospitals and medics said, and forced northern Gaza's main hospital to close.  More than 48 people were killed in and around the Palestinian territory's southern city of Khan Younis, some hitting houses and tents sheltering displaced people, according to Nasser Hospital, which said it struggled to count the dead because of the condition of the bodies. Eighteen children and 13 women were among them, spokesperson Weam Fares said.  In northern Gaza, a strike on a home in the built-up Jabaliya refugee camp killed nine members of a family, according to the Gaza Health Ministry's emergency services. Another strike on a residence in Jabaliya killed 10, including seven children and a woman, according to the civil defence, which operates under the Hamas-run government. In Gaza City, Um Mahmoud al-Aloul lay across the shrouded body of her daughter, Nour al-Aloul. “You took my soul with you,” she cried. “I used to turn off my phone because of how much you called.” Israel's military had no immediate comment, but its statement announcing the ground operations said that preliminary strikes over the past week killed dozens of militants and struck more than 670 targets. Israel blames civilian casualties on Hamas because the militant group operates from civilian areas. Israel launched the offensive Saturday with the aim of seizing territory, displacing hundreds of thousands of Palestinians to Gaza's south and taking greater control of aid distribution. An Israeli blockade on food, medicine and other supplies is now in its third month, with global food security experts warning of famine across the territory of more than 2 million people. Israel has said it is pressuring Hamas to agree to a temporary ceasefire on Israel's terms — one that would free Israeli hostages held in Gaza but wouldn't necessarily end the war. Hamas says it wants a full withdrawal of Israeli forces and a pathway to ending the war as part of any new ceasefire deal. (With inputs from AP) © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-18T23:40:39+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/trending/news/kailash-mansarovar-yatra-strange-experiences-of-mountaineers-who-tried-to-climb-mount-kailash-will-surprise-you-2025-05-05-988667",
        "title": "Strange experiences of mountaineers who tried to climb Mount Kailash will surprise you",
        "content": "There are countless mountains on Earth, almost every one of which has been conquered by humans. Humans have also conquered the world's highest mountain range, Everest. Mount Everest is 29,000 feet high, and hundreds of people have climbed it, but Kailash is a mountain that is only 22,000 feet high, yet no one has been able to climb it to date. One reason behind this is that in the year 2001, China completely banned climbing Mount Kailash. This ban was implemented for religious sensitivity and environmental protection.  Mount Kailash is known not only for its geographical structure but also for its spiritual and mysterious powers. People of the Hindu, Buddhist, Jain, and Sikh religions visit this mountain every year. The Kailash Mansarovar Yatra will start on June 30 in the year 2025. So far, many mountaineers have tried to climb Mount Kailash, but every attempt has been unsuccessful. In 2007, Russian mountaineer Sergey Sistikov, along with his team, made an unsuccessful attempt to climb Kailash. Sergey and his team reached some height, but as the height increased, Sergey and his entire team started having severe headaches, muscle cramps, and breathing problems. According to Sergey, \"I felt that this mountain is not accepting me. I thought it better to stop climbing and come down.\" However, it could not be ascertained whether Sergey's journey was authorised or unauthorised because China had banned climbing Kailash in the year 2001 itself. Another climber, Colonel Wilson, tried several times, but each time the weather suddenly deteriorated and he had to return. Such incidents have given Kailash the status of a 'divinely protected area.' Sergey Sistikov of Mount Kailash and Colonel Wilson's team shared their experiences of Kailash. They told that- Some time ago, the Chinese government had prepared a special team of mountaineers to climb Kailash, but as soon as the news came out, spiritual and religious communities around the world started opposing it. People considered it an interference in the abode of Lord Shiva, calling it an attempt to desecrate it. Ultimately, China had to postpone this plan and declare Kailash a 'no-climb zone.' ALSO READ:Where is Manimahesh Kailash? Like Mansarovar, this holy lake is special for pilgrims too © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-05T10:37:49+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/business/personal-finance/do-you-own-more-than-one-credit-card-here-are-pros-and-cons-you-should-know-latest-updates-2025-05-18-990768",
        "title": "Do you own more than one credit card? Here are pros and cons you should know",
        "content": "Credit cards have become a widely used financial tool today. Many individuals choose to own more than one credit card. While these cards offer the convenience of making purchases even without immediate funds, it's important to remember that the amount spent must be repaid by the next billing cycle. Excessive reliance on credit cards can often lead to a debt trap, where failure to pay dues on time may attract high interest rates and penalties, sometimes as steep as 24 per cent. In this article, we will explore both the advantages and disadvantages of having multiple credit cards.  Also Read:High credit score benefits: Easier loans, lower interest rates and even job opportunities | Details Also Read:Apple may ignore Trump's 'not in India' call and continue to manufacture iPhones in India: Know why © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-18T10:04:54+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/video/originals",
        "title": "Originals",
        "content": "Mayawati appoints nephew Akash Anand as BSP's new chief national coordinator | 18 May | Speed News Centre Picks 7 MPs, Including Tharoor And Shinde, For Global Anti-Terror Mission 13 AAP councillors resign, form new party led by Mukesh Goel | 17 May | Speed News From Military Deals to Student Exchanges: How India Is Distancing Itself from Turkey Taliban Turns to India: A New Diplomatic Shift in the Wake of Pakistan's Tensions? Rajnath Singh: IAF crushed Pak-backed terrorism in just 23 minutes from Bhuj | 16 May | Speed News Trump Takes U-Turn On His Statement About Helping Out In India-Pakistan Ceasefire How Does Bhargavastra Work, India's Latest Counter-Drone Weapon? Explained Supreme Court criticises BJP's Vijay Shah for remarks targeting Sofia Qureshi | 15 May | Speed News From Akash to BrahMos: How Indian-Made Weapons Crushed Pakistan's Arsenal | Operation Sindoor India's BrahMos in High Demand: From Asia to Middle East, Nations Eye BrahMos Post-Op Sindoor Justice BR Gavai's Journey from the Slums to the Supreme Court's Top Seat Rajnath Singh to visit Bhuj airbase, inspect India-Pakistan border security | 14 May | Speed News PM Modi Visits Adampur: Decoding The Message That India Sent Across The World | India- Pakistan Ties Speed News: India Says Pakistani Military Chose To Back Terrorists, We Chose To Respond India's Op Sindoor: Over 100 Terrorists Killed, Pak Airbases Hit- How Is This A Decisive Victory? Delhi Missile Attack: Old Video Falsely Shared As India Fights Pakistani Propaganda- Know The Truth! Speed News: Centre Authorises Army Chief to Summon Territorial Officers Amid India- Pak Tensions Pakistani National Exposes Army's Failure In Detecting Indian Missiles: Why Pakistan Failed Again? ‘Sindoor Means Our Lives’: Pahalgam Victim’s Wife Thanks PM Modi For Avenging Their Husband's Death PM Modi Hails Armed Forces As India Launches 'Operation Sindoor' | 7th May | Speed News Operation Sindoor Targets Masood Azhar: Why India Attacked Bahawalpur, How Is It Connected To Azhar? India- Pakistan War: From Missiles To Jets, How Chinese Weapons Form Backbone of Pakistan's Military Speed News: PM Modi Meets NSA Doval; Country Prepares For Nationwide Mock Drill On May 7 SC dismisses tourist safety PIL after Pahalgam attack, criticises petitioner | 05 May | Speed News How Is Pakistan Using TV and Social Media to Undermine the Indian Military After Pahalgam? Explained © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": ""
    },
    {
        "url": "https://www.indiatvnews.com/topic/operation-sindoor",
        "title": "Operation Sindoor",
        "content": "Union Home Minister Amit Shah led a 'Tiranga Yatra' in Sanand, Ahmedabad, on Sunday to commemorate the success of Operation Sindoor, a military campaign launched against terrorists in Pakistan, in response to the Pahalgam terror attack. Congress MP Shashi Tharoor has defended his decision to lead a multi-party delegation abroad under 'Operation Sindoor', emphasising that he sees \"no politics\" in the invitation extended by Union Minister Kiren Rijiju. Tharoor said national service transcends party lines. Battle of Haifa: Along with the Jodhpur Cavalry and the sixteenth Imperial Cavalry Brigade, soldiers from the Mysore Lancers charged on Turkish positions in and around the city of Haifa in September 1918. Mayawati appoints nephew Akash Anand as BSP's new chief national coordinator. Himanta Biswa Sarma alleges Gogoi visited Pakistan for ISI training. Army releases Operation Sindoor video, confirms planned execution and justice. Stay updated with today's Speed News. According to Nuh police, the accused, Armaan, was arrested for allegedly sharing information about the Indian Army and other military activities with a staff member of the Pakistan High Commission in Delhi. India has formed seven all-party delegations to engage with key global partners, including UNSC member states, in the wake of 'Operation Sindoor'. Congress MP Shashi Tharoor will lead a delegation to the US, while another group, led by JD(U) MP Sanjay Jha, will head to Japan. Last month, Akhtar said in an interview that there is hardly \"any warmth today\" in India-Pakistan cultural ties, the veteran screenwriter-poet noted while saying that this is not the time to even think about whether Pakistani artists should be allowed to work in India. On the inclusion of MPs from the Northeast in the Indian delegation, which will visit several national capitals to brief countries about India's stand in its war against Pakistan-sponsored terrorism, Sarma said, \"We are very happy that three important MPs from the Northeast have been included.\" Operation Sindoor: India launched 'Operation Sindoor' on May 7 (Wednesday) to destroy nine terror infrastructures in Pakistan and Pakistan-Occupied-Kashmir (PoK) in retaliation to the Pahalgam terror attack. The action against the Ashoka University associate professor, Ali Khan Mahmudabad, was taken on a complaint by a BJP Yuva Morcha leader. The government will send seven all-party delegations to convey India's zero-tolerance message against terrorism to key partner countries, including members of the UN Security Council, later in the month of May. Pakistan has once again copied India's strategy by deciding to send its representatives on the global stage and present its \"case for peace.\" With these powers in place, the armed forces are prioritising the procurement of equipment such as surveillance drones, kamikaze drones, long-range loitering munitions, and a variety of ammunition for artillery, air defence, and missile systems. Moeed Pirzada also underscored that the Indian side showed satellite images of the damage done to Pakistan's military infrastructure, while Pakistan could not present any satellite images to substantiate its claims. Shashi Tharoor acknowledged Congress’s omission of his name for foreign delegations, stating the government chose him based on his expertise and readiness to serve the nation. In a post on X, Gandhi questioned External Affairs Minister (EAM) S Jaishankar for publicly admitting that the government of India (GOI) had informed Pakistan of the action and asked how many aircraft the Indian Air Force lost as a result. Home Minister Amit Shah said that the Indian Armed Forces destroyed the headquarters of the terror outfits like Jaish-e-Mohammed and Lashkar-e-Taiba in Pakistan. Jyoti Malhotra, arrested alongside six others for allegedly sharing sensitive information with Pakistani agents, runs the YouTube channel *Travel with Jo*, which has around 3,77,000 subscribers. Congress leader Shashi Tharoor, recently criticised within his party for praising Prime Minister Narendra Modi, is among the seven MPs chosen to carry India’s “strong message\" against terrorism to the global stage following Operation Sindoor. Notably, the presence of terror outfits in Pakistan poses a serious threat to South Asia and the world as a whole. Additionally, Pakistan is a nuclear-powered country, with questions being frequently raised over the safety of nuclear weapons in the country. © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": ""
    },
    {
        "url": "https://www.indiatvnews.com/video/yoga",
        "title": "Yoga",
        "content": "Yoga With Swami Ramdev, 17 May 2025: Which work is important for mental health? Yoga With Swami Ramdev, 16 May 2025: Difficulty in breathing due to toxic air? Know how to avoid pollution from Swami Ramdev Yoga With Swami Ramdev, 15 May 2025 : New India will take a pledge today against diseases Yoga, 14 May 2025: Operation Sindoor continues... Battle against diseases with Swami Ramdev Yoga 8 April 2025 : Operation Sindoor showed its strength... border or health, we are ready on every front Yoga 6 May 2025 : Tension on the border, weather is changing mood..how to keep the mind calm, pay attention to health Yoga 5 May 2025 : Which vitamins are deficient in 70% of India's population? Yoga 4 May 2025 : Swami Ramdev will teach you the right way to exercise..Yoga will keep your health great and your body perfect Yoga With Swami Ramdev, 05 May 2025: 10 Yoga Asana will cure sciatica-spondylitis Yoga 02 May 2025 : Redness, pain, burning, infection in the eyes. Vision will become clear with 5 miraculous remedies Yoga With Swami Ramdev, 01 May 2025: How to avoid heart failure in the scorching sun? Yoga With Swami Ramdev, 30 April 2025: Pranayama and yoga are a boon for mental health Yoga 29 April 2025 : Breathing problems increased due to scorching heat... Allergy became the enemy of asthma patients Yoga: Know the remedy how to control BP in summers? Yoga With Swami Ramdev, 27 April 2025: Control depression and anxiety with smile and laughter Yoga With Swami Ramdev, 26 April 2025:  Baba Ramdev Yoga to Cure Joint Pain, Perform Asanas Yoga With Swami Ramdev, 25 April 2025: Diabetes attack… why is heart, liver and kidney in danger? Yoga With Swami Ramdev, 24 April 2025 : Use of weight loss medicine is dangerous for health Yoga With Swami Ramdev, 23 April 2025 : Complete update of terrorist attack with yoga practice Yoga 22 April 2025 : How to make children smart and healthy... know the surefire solution from Swami Ramdev Yoga 21 April 2025 : Muscle stiffness-burning sensation-cramps...how will the blood circulation become normal? Yoga With Swami Ramdev, 20 April 2025: What are the triggers of migraine in the increasing heat Yoga With Swami Ramdev, 19 April 2025 : Why do 65% of the country's people have fatty liver? Yoga With Swami Ramdev, 18 April 2025: Yellow alert issued in plain areas..be careful! Yoga With Swami Ramdev: Temperatures crossed 40 in April, are you prepared for the heat wave? Yoga With Swami Ramdev, 16 April 2025: Big news about 8 hours of sound sleep © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": ""
    },
    {
        "url": "https://www.indiatvnews.com/trending/news/why-are-the-5-abodes-of-lord-shiva-called-panch-kailash-know-details-2025-05-10-989562",
        "title": "Why are the 5 abodes of Lord Shiva called Panch Kailash? Know details",
        "content": "Along with Kailash Mansarovar, there are some other mountains which are considered the abode of Lord Shiva. There are a total of 5 mountains, including Mount Kailash. Each mountain has its importance, but one thing is common to all of them: they are the centre of spirituality and mysticism. It is believed that from time to time, Lord Shiva resides in Panch Kailash. In this article, we are going to give you information about Panch Kailash.  Mount Kailash or Kailash Mansarovar is said to be the main abode of Lord Shiva. Drinking the water of the Mansarovar lake located here washes away the sins of many births. It is believed that Mount Kailash is also the way to heaven, although to date no one has been able to conquer this mountain. It is believed that spiritual energy is required to climb Kailash, the abode of Lord Shiva. Devotees have many transcendental experiences by going there. Mount Kailash is located in Tibet, and Indian devotees have to take a visa to go there because this place is under the jurisdiction of China. One of the Panch Kailash, Adi Kailash, is also known as Chota Kailash. Adi Kailash is in the Kumaon region of Uttarakhand state of India. According to religious beliefs, Lord Shiva practised yoga and meditation while sitting on Adi Kailash. The wedding procession of Lord Shiva and Parvati also rested at this place. Near Adi Kailash mountain is Parvati Lake, which is considered as sacred as Mansarovar. Manimahesh Kailash is located in the Chamba district of Himachal Pradesh. It is believed that this place was created by Lord Shiva for Mother Parvati. A rock on the peak of this mountain is considered to be the form of Shivalinga, i.e., Lord Shiva. It is also mentioned in the scriptures that Lord Shiva did penance here. There is a lake near Manimahesh Kailash in which all sins are washed away by taking a dip in it. This lake is called Mani Mahesh Lake. According to religious beliefs, Lord Shiva met Goddess Parvati for the first time in Kinnaur Kailash. It is described in the Mahabharata that Lord Shiva used to organise a meeting of the gods in winter at this place. Arjuna received the Pashupatastra from Lord Shiva at this place. The speciality of the Shivling located in Kinnaur Kailash is that it changes colour repeatedly. It is white at sunrise, yellow at sunset, and its colour becomes black at night. Many devotees visit Kinnaur Kailash every year. The Shivlinga in Shrikhand Kailash is one of the largest. Statues of Lord Ganesha and Kartikeya can also be seen at this place. The Shrikhand Kailash Yatra takes place only in the month of Shravan. It is believed that the offerings made to Lord Shiva here go to the caves located here. The Shrikhand Kailash Yatra is considered to be the most difficult among the Panch Kailash. ALSO READ:Kailash Mansarovar Yatra: Did Pandavas undertake the holy yatra? Know here what religious scriptures say © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-10T00:05:08+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/news/india/constitution-of-india-supreme-its-3-pillars-hold-equal-importance-cji-br-gavai-2025-05-18-990828",
        "title": "Constitution of India supreme, its three pillars hold equal importance: CJI BR Gavai",
        "content": "Chief Justice of India BR Gavai on Sunday emphasised that neither the judiciary nor the executive, but the Constitution of India was supreme and its pillars must work together. Justice Gavai, who was sworn in as the 52nd Chief Justice of India earlier this week, addressed his felicitation ceremony and the state lawyers' conference organized by the Bar Council of Maharashtra and Goa.  He expressed his happiness over the nation's progress, stating that India has not only become stronger but has also advanced socially and economically, and continues to move forward on these fronts. \"Neither the judiciary nor the executive and the Parliament is supreme, but it is the Constitution of India which is supreme, and all the three wings have to work as per the Constitution,\" he said. He emphasised that the basic structure of the country remains strong and that all three pillars of the Constitution hold equal importance. \"All the organs of the Constitution must reciprocate and show due respect to each other,\" he stated. During the event, a book highlighting 50 notable judgments delivered by Justice Gavai was also released. CJI Gavai highlighted his determination to ensure that the constitutional guarantees reach every section of Indian society. \"The only thing I can say is that whatever short period that I have, I will do my best to stand by my oath to uphold the rule of law, to uphold the Constitution of India,\" he said. Justice Gavai added that he would strive to connect with the most common citizens of the country, aiming to realize the Constitution's vision of \"social and economic equality along with political equality.\" Reflecting on his nearly four-decade-long legal career, the Chief Justice shared heartfelt memories that showcased his deep bond with the legal fraternity. \"From 1985 to 2023, I was a member of the Bar, and after my retirement in November 2025, I will be one again. This is like a family celebration for me,\" he said. (With PTI inputs) © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-18T18:58:04+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/video/news",
        "title": "News",
        "content": "Centre Cancels Security Clearance Of Turkish Firm Celebi Airport Services Over Security Concerns Jaishankar Gives Bold Statement On Operation Sindoor, Says  \"We Held Pakistan Accountable” Zelenskyy States Russian President Vladimir Putin Isn't Serious About Peace Talks! Trump Visits Sheikh Zayed Grand Mosque In Abu Dhabi During His Middle East Tour Indian Fruit Vendors Boycott Turkish Produce Over Alleged Support to Pakistan and Terrorism Trump Says He's 'Unsure' if Putin Will Participate, Hours Before Peace Talks With Zelenskyy 'Bhargavastra': India Successfully Tests Advanced Anti-Swarm Drone System in Defence Breakthrough Trump, Qatari Emir Announce Historic $200B Deal for 160 Boeing Jets Pakistan Releases Detained BSF Soldier Shaw, India Receives Him at Attari Border Trump Repeats 'Peacemaker' Pitch, Suggests Hosting Modi And Shehbaz For Dinner To Ease Tensions MEA's Randhir Jaiswal hits back at Pak FM Dar over his comments on Operation Sindoor US China Trade Deal: Trump and Xi agree to negotiate trade deal, What it means for India ? Air Marshal AK Bharti Gives 'Bold Response' To Pakistan's Casualties | Operation Sindoor Former Envoy To Pakistan G Parthasarathy Hails Op Sindoor, Says \"Fanatic Asim Munir Has Paid Price\" India- Pakistan Tensions: Here's What PM Modi told US VP JD Vance On Call! Mortal Remains Of Subedar Major Pawan Kumar, Martyred In Pakistani Shelling, Arrive In His Hometown Shashi Tharoor hails Ex-PM Indira Gandhi, Says \"Situation In 1971 Was...\" | India- Pak Ceasefire Jammu- Kashmir: Peace And Calmness Return As India-Pakistan Reach An 'Understanding' Pakistani Propaganda Busted: India Shows Time Stamped Images Of Air Bases That Remain Undamaged India- Pakistan Conflict: How Does An Air Defence System Work- All You Need To Know! India- Pak Tensions Rise As Pakistani Shelling Damages Civilian Areas In Jammu Jammu & Kashmir: CCTV Footage Captures Pakistan Shelling At A Residence In Poonch India Thwarts Major Missile Attack By Pakistan | Air Raid Sirens Sounded In Chandigarh Vance Says India-Pakistan Tensions Not America's Concern, Claiming U.S. Can't Control The Situation EAM Jaishankar Speaks With U.S. Secretary of State Rubio Amid India-Pakistan Tensions Amid Operation Sindoor, SP Vaid Recounts Experience With Masood Azhar During Kandahar Hijack © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": ""
    },
    {
        "url": "https://www.indiatvnews.com/rssfeed",
        "title": "RSS Feeds",
        "content": "INDIA TV offers you RSS feeds, in the RSS 2.0 specification, for all its sections and the breaking news section so that you won't even miss a single story. RSS feeds are files in the XML format  which are used by clients, also known as desktop aggregators and RSS readers, to pull the latest updated information from the websites that offer them. You can choose any reader of your liking from the Dmoz open directory project listing here: But if you are looking for a lightweight RSS reader on the Windows platform, we would suggest the GreatNews RSS reader, which is personal favourite with us.INDIA TV offers you RSS feeds, in the RSS 2.0 specification, for all its sections and the breaking news section so that you won't even miss a single story. RSS feeds are files in the XML format which are used by clients, also known as desktop aggregators and RSS readers, to pull the latest updated information from the websites that offer them. You can choose any reader of your liking from the Dmoz open directory project listing here: But if you are looking for a lightweight RSS reader on the Windows platform, we would suggest the GreatNews RSS reader, which is personal favourite with us. RSS (really simple syndication) service is a means by which India TV.com offers feeds of story headlines in XML format (\"RSS Content\") to visitors to India TV.com (the \"India TV Site\") who use RSS aggregators. These Terms of Use govern your use of the RSS service. The use of the RSS service also is subject to the terms and conditions, which governs the use of India TV's websites, information services and content. These Terms of Use and the India TV Interactive Service Agreement may be changed by India TV at any time without notice. RSS is a free service offered by India TV for non-commercial use. Any other uses, including without limitation the incorporation of advertising into or the placement of advertising associated with or targeted towards the RSS Content, are strictly prohibited. You must use the RSS feeds as provided by India TV, and you may not edit or modify the text, content or links supplied by India TV. For web posting, reprint, transcript or licensing requests for India TV material, please send your request tomail@indiatvnews.com. The RSS service may be used only with those platforms from which a  functional link is made available that, when accessed, takes the viewer  directly to the display of the full article on the India TV Site. You may  not display the RSS Content in a manner that does not permit successful  linking to, redirection to or delivery of the applicable India TV Site web page. You may not insert any intermediate page, splash page or other  content between the RSS link and the applicable India TV Site web page. India TV retains all ownership and other rights in the RSS Content, and any and all India TV logos and trademarks used in connection with the RSS Service. You must provide attribution to the appropriate India TV website in connection with your use of the RSS feeds. If you provide this attribution using a graphic, you must use the appropriate India TV website's logo that we have incorporated into the RSS feed. India TV reserves the right to discontinue providing any or all of the RSS feeds at any time and to require you to cease displaying, distributing or otherwise using any or all of the RSS feeds for any reason including, without limitation, your violation of any provision of these Terms of Use. India TV assumes no liability for any of your activities in connection with the RSS feeds or for your use of the RSS feeds in connection with your website. © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": ""
    },
    {
        "url": "https://www.indiatvnews.com/sports/cricket/kl-rahul-slams-seventh-t20-hundred-leaves-suryakumar-behind-as-he-hunts-virat-kohli-rohit-sharma-2025-05-18-990846",
        "title": "For first time in IPL history, KL Rahul achieves never-seen-before record in tournament during DC vs GT clash",
        "content": "Delhi Capitals star batterKL Rahulhas registered a never-seen-before record in the history of the Indian Premier League. For the first-ever time inIPL, Rahul has achieved what no one else could have done in the tournament.  Rahul slammed a well-controlled hundred in the Delhi Capitals' clash against Gujarat Titans. He has become the only player to hit centuries for three different teams in the history of Indian-cash-rich league. Rahul had earlier hit tons for Punjab Kings and Lucknow Super Giants too, and this is his first ton for DC. Meanwhile, Rahul, who had a brilliant outing with the bat registered a couple of more milestones. He shatteredVirat Kohli's record for being the fastest Indian to 8000 T20 runs and now has the joint third-most T20 tons by an Indian. This was Rahul's seventh T20 ton as he continues to make giant strides in the shortest format. Rahul surpassed Suryakumar Yadav, and Sanju Samson, among others in the list of most centuries hit by an Indian in T20s. He now chases stalwarts Virat Kohli andRohit Sharma, who have hit nine and eight centuries, respectively in the format. Most centuries by Indians in T20s: Virat Kohli: 9 tons Rohit Sharma: 8 tons KL Rahul: 7 tons Abhishek Sharma: 7 tons Suryakumar Yadav: 6 tons Sanju Samson: 6 tons Shubman Gill: 6 tons Ruturaj Gaikwad: 6 tons This is Rahul's fifth ton in IPL, which are now the fourth most in the format. The list is led by Virat Kohli, who has eight tons in the Indian cash-rich league. Most 100s in the IPL: 8 - Virat Kohli 7 -Jos Buttler 6 -Chris Gayle 5 - KL Rahul Meanwhile, Rahul added another feather to his illustrious cap as he reached the mark of 8000 runs in T20 cricket. The 33-year-old has become the fastest Indian to get to the mark. He took only 224 innings to get to 8000 runs in the format, while Kohli had reached the mark in 243 outings. Rahul is the third-fastest to the mark overall, only behind Chris Gayle (213 innings) andBabar Azam(218 innings). © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-18T21:16:21+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/auto/upcoming-car-launches-in-april-from-mg-cyberster-to-kia-carens-facelift-check-list-here-2025-04-02-983508",
        "title": "Upcoming car launches in April: From MG Cyberster to Kia Carens Facelift, check list here",
        "content": "As the new financial year commences, several automakers have implemented price increases on their existing cars, citing rising input costs. For those considering the purchase of a new vehicle amid these price hikes, various car manufacturers plan to launch new models in India during April. Below is a list of anticipated car launches for that month.  Citroen will introduce a Dark Edition of the Basalt next month. A recently released teaser video suggests a new black exterior shade will be available, joining the existing five color options. The model is expected to feature blacked-out front and rear skid plates, unique badging, and dark chrome alloy wheels. Similar blacked-out styling is anticipated for the cabin of the Basalt. Scheduled for launch on April 14, 2025, the Tiguan R Line will serve as Volkswagen’s most premium SUV offering in India. This new SUV is 30mm longer than the previous-generation Tiguan currently available. It will showcase updated styling, including redesigned headlights, sportier front and rear bumpers, 19-inch alloy wheels, R Line side panels, full-width LED light strips, and a rear spoiler. The Tata Curvv will soon receive a Dark Edition, following the trend set by the Nexon, Harrier, and Safari models. Available exclusively in the top-spec Accomplished trim, the Curvv Dark Edition will feature an all-black color scheme for both interior and exterior elements. MG will launch its first all-electric sports car, the Cyberster, in India in April, with sales limited to MG Select premium showrooms. The design of the Cyberster includes an upward-swooping fascia, a long bonnet, standard 20-inch wheels, arrow-shaped tail-lamps connected by an LED strip, and scissor doors. The new-generation Kodiaq will feature updated styling that aligns with Skoda’s global models. The front will include Kushaq-inspired headlights, a new grille, and a redesigned bumper. The side profile will present smoother lines compared to the outgoing model, with door-mounted wing mirrors and new alloy wheels. The rear end will feature connected tail-lamps and prominent cladding. The Kia Carens MPV is set to receive a facelift three years after its initial launch in India. Kia plans to market this updated model alongside the current version. The facelift will introduce a new name, and spy images have indicated a higher bonnet line for an SUV-like appearance, along with Syros-inspired headlamps, vertically-oriented tail-lamps with an LED light bar, and new 16-inch dual-tone alloy wheels. ALSO READ:Tata, Maruti Suzuki, Kia, other automakers to implement price hikes from April 1 © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-04-02T13:32:41+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/video",
        "title": "Video",
        "content": "AWACS Strike Explained: How India's Operation Sindoor Crippled Pakistan's Air Defence Mayawati appoints nephew Akash Anand as BSP's new chief national coordinator | 18 May | Speed News Yoga, 18 May 2025: What is the biggest mistake of 90% of people in India? Aaj Ka Rashifal, 18 May, 2025: Know from Acharya Indu Prakash what your stars are saying today Centre Picks 7 MPs, Including Tharoor And Shinde, For Global Anti-Terror Mission 13 AAP councillors resign, form new party led by Mukesh Goel | 17 May | Speed News © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": ""
    },
    {
        "url": "https://www.indiatvnews.com/sports/cricket/shubman-gill-goes-past-virat-kohli-in-major-t20-record-during-dc-vs-gt-ipl-2025-clash-2025-05-18-990850",
        "title": "Shubman Gill goes past Virat Kohli in major T20 record during DC vs GT IPL 2025 clash",
        "content": "Gujarat Titans captainShubman Gillhas surpassedVirat Kohliin a major T20 record during his team's clash against Delhi Capitals at theArun JaitleyStadium on Sunday, May 18. Chasing 200 against the Capitals, GT skipper Gill and Sai Sudharsan led the way in the second innings.  Meanwhile, Gill has registered a major milestone in T20 cricket. The GT skipper completed his 5000 runs in T20 cricket with his stroke-filled knock against DC at the capital. He has become the second-fastest Indian to get to 5000 runs in the format, surpassing Virat Kohli and being the second-quickest only behindKL Rahul. Gill took 154 innings to get to the mark, while Kohli needed 167 innings to get to 5000 runs in the format. Rahul, who is on top of this list, got to the milestone in 143 outings. Gill has ben in brilliant touch in the ongoing season. He has six fifty-plus scores out of 12 innings in the ongoing season. Gill went unbeaten in 93 from 53 balls as GT chased down 200 with 10 wickets in hand with Sai Sudharsan scoring an unbeaten 108. GT's win ensured the qualification of three teams in theIPL2025 playoffs. GT, Royal Challengers Bengaluru and Punjab Kings have officially qualified for the IPL 2025 playoffs after the Titans chased down 200 with 10 wickets in hand and six balls to spare. GT achieve a never-seen-before record in IPL history Sudharsan and Gill made a mockery of the Capitals' bowling. Their insane consistency churned out yet another unbelievable chapter as they hunted down the 200-run target without losing a single wicket and with six balls to spare. This marked the first instance of a team chasing down a 200 or 200-plus target with 10 wickets in hand. This is also only the second instance of a team chasing 200 or more in T20 cricket without losing a wicket, with the only other instance being when Pakistan hunted down 200 against England in Karachi in 2022. © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-18T22:50:34+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/auto/ferrari-296-versione-speciale-spotted-before-launch-faster-and-more-aggressive-2025-04-29-987921",
        "title": "Ferrari 296 Versione Speciale spotted before launch: Faster and more Aggressive!",
        "content": " Ferrari’s highly anticipated performance upgrade to the 296 GTB – the Ferrari 296 Versione Speciale – has been leaked online ahead of its official debut. This aggressive and aerodynamically enhanced variant is now creating a buzz among car enthusiasts globally, including in India, where Ferrari has a loyal fan base.  The leaked images show that the 296 Versione Speciale keeps the core DNA of the 296 GTB but with noticeable enhancements. The front bumper has been redesigned to feature a larger splitter and a prominent air intake, while the bonnet now includes a functional scoop flanked by winglets – elements aimed at improving downforce and airflow. The side profile is bolder, with sculpted wheel arches and lightweight alloy wheels housing carbon ceramic brakes. At the rear, the Speciale boasts massive air vents on both sides and a redesigned, more aggressive diffuser. The spoiler merges seamlessly into these intakes, further boosting the car’s aerodynamic prowess. Although Ferrari has not officially confirmed the specs, the 296 Versione Speciale is likely to use an enhanced version of the existing hybrid setup seen in the 296 GTB. That includes a twin-turbocharged 3.0-litre V6 paired with an electric motor. In the standard GTB, this combination delivers 819 hp and 740 Nm of torque, enabling a 0-100 kmph sprint in just 2.9 seconds and a top speed of 330 kmph. Expect the Versione Speciale to push these limits further with software and mechanical upgrades. While there’s no official word on the Indian launch yet, Ferrari usually brings its top-spec models to India after their global debut. Given the rising interest in high-performance cars in India, the 296 Versione Speciale could find a niche audience here.   © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-04-29T22:39:08+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/video/aap-ki-adalat",
        "title": "Aap Ki Adalat",
        "content": "Mamta Kulkarni In Aap Ki Adalat: Mamta Kulkarni under the questions of Rajat Sharma Gaur Gopal Das In Aap Ki Adalat: Watch the interesting interview of ISKCON monk and motivational speaker Gaur Gopal Das in 'Aap Ki Adalat'. AAP MP Raghav Chadha And Bollywood actress Parineeti Chopra in Aap Ki Adalat Dinesh Lal Yadav In Aap Ki Adalat: Bhojpuri star Nirahua in 'Aap Ki Adalat' Sunny Deol In Aap Ki Adalat: Watch full episode with Rajat Sharma Giriraj Singh In Aap Ki Adalat: Watch full episode with Rajat Sharma Acharya Pramod Krishnam In Aap Ki Adalat: Watch Full Episode with Rajat Sharma Mahmood Madani in Aap Ki Adalat: Rajat Sharma's questions and Jamiat Chief Maulana Mahmood Madani's answers in 'Aap Ki Adalat' Prashant Kishore In Aap Ki Adalat: Political strategist Prashant Kishore in 'Aap Ki Adalat' Kangana Ranaut In Aap Ki Adalat: Kangana Ranaut's frank interview in 'Aap Ki Adalat', see what the 'Queen' said Aap Ki Adalat: Rishabh Pant in the dock of Aap Ki Adalat CM Yogi Adityanath In Aap Ki Adalat: UP CM Yogi Adityanath surrounded by Rajat Sharma's questions in Aap Ki Adalat Chirag Paswan In Aap Ki Adalat: Watch full episode with Rajat Sharma Chirag Paswan In Aap Ki Adalat: Chirag Paswan told the truth about differences with his uncle! 'PM Modi can win 214 to 240 Lok Sabha seats', predicts Telangana CM in Rajat Sharma's Aap Ki Adalat show 'PM Modi is 'MahaYogi' of this age': BJP's Hyderabad candidate Madhavi Latha in Aap Ki Adalat Ravi Shankar Prasad responds to Rajat Sharma in Aap Ki Adalat Rajnath Singh In Aap Ki Adalat: Watch Full Episode with Rajat Sharma Asaduddin Owaisi In Aap Ki Adalat: AIMIM Chief Asaduddin Owaisi in Aap Ki Adalat Pushkar Singh Dhami In Aap Ki Adalat: Watch full episode with Rajat Sharma Prashant Kishor In Aap Ki Adalat: Political strategist Prashant Kishor surrounded by questions from Rajat Sharma in AAP ki Adalat WATCH: Congress general secretary Sachin Pilot in Aap Ki Adalat, answering questions asked by Rajat Sharma Sadhvi Rithambara in Aap Ki Adalat: Watch Exclusive Interview With Rajat Sharma on India TV Pankaj Tripathi In Aap Ki Adalat: From childhood to filmy career, the actor shares his journey Watch Badshah In Aap Ki Adalat Watch Aap Ki Adalat full episode with Hardeep Singh Puri © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": ""
    },
    {
        "url": "https://www.indiatvnews.com/weather-forecast",
        "title": "New Delhi Weather Today  19 May 2025",
        "content": "Sunrise 5:29 AM Sunset 7:06\r PM Moonrise 12: AM Moonset 9:48 AM Weather alert: IMD warns of thunderstorms, hail in multiple states, heatwave to ease from May 1 Passengers 'stranded' for hours protest at Bhubaneswar airport after diversion of flights Delhi temperature reaches 42.1 degrees Celsius, highest in three years Weather update: Rain, thunderstorms likely in Delhi-NCR and other parts of north India today Heatwave in Rajasthan from April 14, IMD predicts temperature at 45-46 degrees Celsius Jharkhand weather: IMD issues Orange alert, hailstorms, lightning and gusty winds predicted IMD heatwave forecast: Some relief in north India from tomorrow; rains predicted in these states NZ vs IND weather report: Will rain affect crucial Champions Trophy Group A clash in Dubai? SA vs ENG weather report: Will rain affect South Africa vs England Champions Trophy clash in Karachi Weather-proof your skin: 5 dermatologist-approved tips for the changing seasons Weather update: Rajasthan witnesses sudden rise in temperature, drizzle expected on February 16 West Bengal: 10 flights delayed at Kolkata airport as dense fog condition prevails Rajasthan weather: Dry weather to persist for next one week, temperatures dip to 2 degrees Celsius Himachal weather update: IMD issues 'yellow alert' as fresh snowfall blankets several regions Mahakumbh: Planning for 'amrit snan' on Mauni Amavasya? Check IMD weather prediction for Prayagraj Cold conditions intensify in Rajasthan, Sikar shivers at 3.5 degrees Celsius Rajasthan weather update: Light rains in parts of state due to fresh western disturbance Prayagraj weather: IMD predicts fog conditions till January 20 Tamil Nadu: Flight operations disrupted at Chennai Airport due to poor visibility Weather today: IMD predicts rain and thunderstorms today in these parts of Delhi-NCR Jammu and Kashmir: Snowfall expected over weekend, slippery conditions on Mughal road Rajasthan weather update: Cold wave persists in state, IMD predicts rain due to western disturbance © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": ""
    },
    {
        "url": "https://www.indiatvnews.com/entertainment/news/the-filmy-hustle-exclusive-kim-sharma-opens-up-about-instinctive-decisions-in-movie-business-2025-05-18-990853",
        "title": "The Filmy Hustle Exclusive: Kim Sharma opens up about instinctive decisions in movie business",
        "content": "Kim Sharma, who currently works with directorKaran Joharas the Vice President of Dharma Cornerstone Agency, in conversation with Akkshay Rathie at India TV's 'The Filmy Hustle' podcast, spoke about the importance of instinctive decision-making in the movie business . She explained that their agency works with partners on two fronts. On one side, there are actors whose well-being, self-representation, positioning, and strategies are our highest priority.  Talking about the other side, she said, \"But there are also brands, producers, directors, filmmakers, and writers who trust us and our opinions.\" She also mentioned, \"I think a large part of the decisions we make are based on instinct. There is no fixed formula, you can't say this is going to work and this isn't.\" Kim says, 'A great instinct is a great tool in this business' Commenting on their approach, Kim said, \"A great instinct is a great tool in this business.\" She explained that both she and Rajeev Masand, who are relatively \"outsiders\" to the industry in some ways, rely totally on their instincts. \"His large connections, my friends within the industry and my understanding of what it meant to be an actor,\" she added. She admitted that she hadn't had a successful acting career, but still, she had ten years of experience in the business. \"I may not know the dizzying highs, but I know what a bad day feels like. And I believe it’s more important to be there for someone on their bad days than on their good days.\" Speaking about Rajeev Masand, she noted, \"Over the years, he has been able to give so much knowledge to the business and be authoritative that actors automatically take his advice or suggestions as a sign of a word.\" Kim emphasised the role of intuition in casting and knowing that they are right for the role, \"I place instinct at the top when it comes to decision-making. That feeling of just looking at something, and that only happens when you are completely drenched with the character when you know them inside out, and you know they can do this and this can work.\" By giving the example of Bollywood actress Triptii Dimri in the 2023 film, 'Animal', she said, \"Would you traditionally cast a mainstream heroine in such a small role? Probably not. But that’s where instinct comes in. Karan and Rajeev took that call, and just look at what it’s done for her.\" Also Read:The Filmy Hustle Exclusive: Kim Sharma considers influencers better than actors, here's why  © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-18T23:07:48+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/cms/about-us",
        "title": "About Us",
        "content": "The rise of India TV as India's leading news channel within a short span of its existence owes a lot to the vision of its chairman and editor-in-chief Rajat Sharma and the dedication and toil of its ever-growing team of bright news TV professionals. Rajat Sharma co-founded India TV with his wife Ritu Dhawan in April, 2004 from a swanky studio in Film City, Noida, then considered one of Asia's largest news TV studios. In 1997, Rajat Sharma and Ritu Dhawan set up their own production house –Independent News Service (INS), the parent company which owns India TV. In a short period, India TV has created benchmarks in innovation, impact, ratings, time spends, and viewer-support. Indeed, India TV's newsbreaks have inspired talk shows on rival channels, Bollywood films, BBC documentaries and articles in Time Magazine, even Amul hoardings. In today's rampant me-too-ism, India TV is, perhaps, the only Hindi news channel that is perceived as \"courageous\" and \"different.\" The channel's No.1 position is no accident. It is the result of Mr. Sharma leading the way on the lonely path of \"credibility first.\" It is the result of the efforts of a self-made man who kept both his feet firmly on the ground, a journalist for whom the viewer's interest has been paramount. Today Mr. Sharma's editorial decision-making reaches out to an audience of 90 million C&S homes. The human resource of India TV resides among loyal viewers and 500 staffers. INS has investment from ComVentures, a top Silicon Valley venture fund, and a leading private equity entity. The enterprise value of INS which crossed Rs 500 crore in January, 2008 has been rising by leaps and bounds. India TV has state-of-the-art digital connectivity and its Broadcast Centre covers an area of more than 1,28,000 square feet in Sector 85, Noida. Please contact Mr. K K Dutt (09811084841 & 09350117823)for new STB for getting INDIA TV. © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": ""
    },
    {
        "url": "https://www.indiatvnews.com/sports/cricket/rajasthan-royals-bottle-up-another-chase-as-punjab-kings-put-one-foot-inside-ipl-2025-playoffs-2025-05-18-990834",
        "title": "Rajasthan Royals bottle up another chase as Punjab Kings put one foot inside IPL 2025 playoffs",
        "content": "Rajasthan Royals bottled up another run chase despite having a rollicking start to their pursuit of 220 against Punjab Kings at the Sawai Mansingh Stadium on Sunday, May 18. Youngster Vaibhav Suryavanshi and Yashasvi Jaiswal took the Royals off to a blinder with the team's highest powerplay score of 89/1. However, losing wickets later on meant the Royals slipped and could not recover as they fell short by 10 runs.  Jaiswal and Suryavanshi turned on the carnage in the powerplay. Jaiswal pummelled Arshdeep Singh for 22 runs in the first over before Suryavanshi also joined the party. The 15-year-old, who created history by becoming the youngest player to hit T20 cricket earlier this season, was putting himself in a position for another big score, however, he fell for a 15-ball 40. Jaiswal too departed in the ninth over when RR were on 109 and then the Royals slipped, like they have done ever so much this season. Dhruv Jurel andShimron Hetmyerwere at the epicentre yet again. While Jurel made a fighting 31-ball 53, Hetmyer scored 11 from 12 deliveries as the Royals lost their way and went down by 10 runs in the end. Punjab Kings had earlier set a daunting total of 219/5 on the back of their middle-order batters. After being in choppy waters at 34/3, Punjab needed a revival from their middle-order. Nehal Wadhera led the comeback by example, as he and the other batters kept the scoring rate going. Wadhera eyed a hundred but fell on 70 in the 16th over. Shashank Singh led the charge in the death overs. He kept churning out boundaries and scored 59, while Azmatullah Omarzai also added the finishing touches with his 21. The two helped Punjab get to a huge total of 219, which is the highest in Jaipur. The win has helped Punjab put one foot inside theIPL2025 playoffs. They now have 17 points from 12 matches and face Delhi Capitals and Mumbai Indians next. © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-18T19:34:36+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/education/higher-studies/iit-roorkee-terminates-mou-with-turkiye-s-inonu-university-after-jnu-jamia-milia-islamia-2025-05-16-990589",
        "title": "IIT Roorkee terminates MoU with Turkiye’s Inonu University after JNU, Jamia Milia Islamia",
        "content": "In a significant move, IIT Roorkee has terminated its academic MoU with Inonu University, Türkiye, citing national security concerns, as reported by Indian Express. The agreement had facilitated academic and research collaborations, including student and faculty exchanges. In an official statement, IIT Roorkee clarified that its international partnerships will prioritise national and strategic interests. ''The institute will continue to pursue global collaborations that align with its academic objectives and contribute to strengthening India's research and innovation ecosystem,' it added.\"  Lovely Professional University (LPU) has also terminated all Memoranda of Understanding (MoUs) with institutions in Turkiye and Azerbaijan. The Punjab-based university has formally ended six academic partnerships with institutions in Turkiye and Azerbaijan, citing recent geopolitical developments that it deems contrary to India's national interest. This unprecedented decision includes the immediate termination of student and faculty exchange programs, joint research projects, dual degree initiatives, and all other forms of academic collaboration with institutions from the two countries. The move comes in response to the pro-Pakistan stance of Turkiye and Azerbaijan during a recent period of heightened Indo-Pak tensions. Earlier this week, Jawaharlal Nehru University (JNU) also cancelled their academic Memoranda of Understanding (MoUs) with international institutes, citing national security concerns. In a statement posted on X, JNU said, \"Due to National Security considerations, the MoU between JNU and Inonu University, Turkiye stands suspended until further notice. JNU stands with the Nation.\" Following this trend, Jamia Millia Islamia, and Maulana Azad National Urdu University (MANNU), Hyderabad, have terminated their academic Memoranda of Understanding (MoUs) with the international institutes, citing national security concerns. (With inputs from agencies) © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-16T16:21:05+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/video/lifestyle",
        "title": "Lifestyle",
        "content": "Yoga Tips, 14 Dec 2024: Swami Ramdev Shares Helpful Yogasanas to Treat Thyroid Problems Yoga Tips, 7 Dec 2024:  Panic regarding health...Enter the '5 AM' Club Yoga Tips, 6 Dec 2024: 2 deadly diseases... why have they become the enemy of bones? Yoga Tips, 05 Dec 2024: Why has the condition of 'Brain Rot' become the enemy of children? Yoga Tips, 4 Dec 2024: This year India may face severe winter, Know why? Yoga Tips, 30 Nov 2024:  How much has smog increased the risk of allergy and migraine? Yoga Tips, 29 Nov 2024: How dangerous are the symptoms of 'burnout syndrome' in winter? Yoga Tips, 22 Nov 2024:  Medicines are ineffective due to pollution…how effective is yoga? Yoga Tips, 21 Nov 2024: Difficulty in breathing due to toxic air? Know how to avoid pollution from Swami Ramdev Yoga Tips, 20 Nov 2024: Difficulty in breathing due to toxic air? Know how to avoid pollution from Swami Ramdev Swami Ramdev's Yoga asanas and Ayurvedic remedies for stroke and brain disorder problems Yoga Tips, 16 Nov 2024: Control depression and anxiety through smile and laughter Yoga Tips, 15 Nov 2024: Difficulty in breathing due to toxic air? Know how to avoid pollution from Swami Ramdev Yoga Tips, 14 Nov 2024: Increased weight causes diabetes, know from Swami Ramdev how to control it Yoga Tips, 13 Nov 2024: Thyroid can be cured permanently with Swami Ramdev's yoga tips YOGA TIPS, 20 Oct 2024: Difficulty in breathing due to toxic air? Know how to avoid pollution from Swami Ramdev YOGA TIPS, 11 Oct 2024: Weakness in muscles can cause many diseases, know the symptoms from Swami Ramdev Yoga Tips, 10 Oct 2024: Know how to prevent diseases caused by plastic YOGA TIPS , 02 Oct 202: Swami Ramdev's life management class on Mahatma Gandhi's 155th birth anniversary Yoga TIPS,  27 Sep 2024:  How to take care of your Mental Health? Swami Ramdev shares tips Yoga Tips, 25 September 2024: Know from Swami Ramdev how to get rid of migraine? Yoga TIPS 21 Sep, 2024:  Swami Ramdev shares Yoga for Alzheimer effective yoga asanas Yoga TIPS; 20 Sep, 2024: Swami Ramdev shares yoga asanas, pranayamas and its benefits Yoga TIPS, 19 Sep, 2024: How can social media affect your physical health? YOGA TIPS:  Which disease is more prevalent in which the state of India? Yoga Tips, 13 Sep 2024:  Pranayamas to strengthen nervous system by Swami Ramdev © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": ""
    },
    {
        "url": "https://www.indiatvnews.com/lifestyle/food/beat-the-summer-heat-with-watermelon-bruschetta-know-step-by-step-recipe-for-this-refreshing-snack-2025-05-16-990554",
        "title": "Beat the summer heat with Watermelon Bruschetta; know step-by-step recipe for this refreshing snack",
        "content": "When the summer heat kicks in, there’s nothing better than a cool, light, and flavourful snack. If you're looking for something quick, fresh, and a little bit fancy, Watermelon Bruschetta is the perfect choice. This twist on the traditional Italian appetiser uses juicy watermelon, fresh herbs, and creamy cheese to create a delicious balance of sweet and savoury. Whether you’re planning a garden party or a light brunch, or just want something fun to nibble on, this recipe is sure to impress.  Bruschetta is usually made with toasted bread topped with tomatoes, garlic, and olive oil. But in this summer version, watermelon replaces the tomatoes, giving it a juicy and refreshing spin. It’s paired with basil and feta cheese, then finished with a drizzle of balsamic glaze for a touch of sweetness and tang. The result is a vibrant, colourful appetiser that’s light, refreshing, and full of flavour—just right for hot days. Here’s a simple 5-step recipe you can try at home. It takes just 15–20 minutes and serves 6 to 8 people. Step 1:Preheat your oven to 190°C (375°F). Lightly brush each baguette slice with olive oil and toast them for about 5–7 minutes until golden and crisp. Step 2:In a bowl, combine the diced watermelon, chopped basil, and a pinch of salt and pepper. Mix gently so the watermelon doesn’t get mushy. Step 3:Spoon the watermelon mix onto each toasted bread slice. Be generous! Step 4:Top with crumbled feta cheese, then drizzle a little balsamic glaze over each piece for that sweet and tangy kick. Step 5:Enjoy immediately while the bread is still crisp. The fresher, the better! This Watermelon Bruschetta is not just a snack—it’s a conversation starter. Fresh, easy to make, and full of summer vibes, it’s a must-try dish for your warm-weather menu. Give it a go, and you might just find your new favourite seasonal appetiser! ALSO READ:Drinking cumin water on an empty stomach is a boon for weight loss, know how to prepare © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-16T12:38:56+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/delhi/delhi-fire-breaks-out-at-sarojini-nagar-market-e-rickshaw-catches-fire-in-farsh-bazaar-2025-05-18-990855",
        "title": "Delhi: Fire breaks out at Sarojini Nagar Market, e-rickshaw catches fire in Farsh Bazaar",
        "content": "A fire broke out at three shops in Delhi's Sarojini Nagar market late Sunday, prompting a swift response from the Delhi Fire Service. Fire Officer Manoj Kumar said a call about the blaze was received at 9:27 pm, following which five fire tenders were dispatched to the scene.  \"The fire is almost extinguished, and no injuries have been reported,\" Kumar said.   The cause of the fire is yet to be determined. Further details are awaited. In a separate incident, six people were injured after an e-rickshaw caught fire in east Delhi early Sunday, officials said. The fire broke out around 3.30 am in Farsh Bazar area and smoke spread to a nearby building, a Delhi Fire Service (DFS) official said. Six residents, who reportedly suffocated due to the smoke were rescued and taken to a hospital, he said. Their condition is stated to be stable, the official added. (With agency inputs) © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-18T23:48:09+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/latest-news",
        "title": "Latest News",
        "content": "NSA Doval holds talk with Iran's NSC Secy, affirms India's interest in development of Chabahar port Israel launches extensive new ground operations in Gaza Strip as air strikes kill at least 103 Will cheaper Scotch transform India's whisky market under the new India-UK trade pact? The Filmy Hustle Exclusive: Kim Sharma opens up about instinctive decisions in movie business Google Pay, PhonePe, Paytm users: NPCI rolls out new rules for UPI beneficiary names Gujarat Titans confirm spot in IPL 2025 playoffs after win over DC; RCB, PBKS officially qualify too Do you know Pineapple is beneficial for which body part? Know about its all-around benefits here IIT Bombay suspends all ties with Turkish institutes, universities over support for Pakistan Hypertension at work? Practice these simple lifestyle changes for busy professionals to stay healthy Ferrari 296 Versione Speciale spotted before launch: Faster and more Aggressive! Horoscope Today, May 18: Virgos to get better results, know about other zodiac signs Fresh Covid wave hits China and Thailand as cases surge across Asia | Here's what you should know Indiatvnews.com is the biggest news destination for Latest news, breaking headlines, breaking news, todays news, videos, current news from India and around the world.  Check out todays most recent up-to-date news coverage on indiatvnews.com. indiatvnews.com is your platform for all the latest news including Live India News, Politics News, Election News, Bollywood News, Lifestyle News, South Cinema News, Horoscope, Cinema News, Sports News, World News, Business News, Auto News, Tech News, Education News, Exam results, Job openings, Sports News, Cricket Latest Updates, Share market news and general news from India and around the world. © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": ""
    },
    {
        "url": "https://www.indiatvnews.com/astrology/horoscope-today-may-18-virgos-to-get-better-results-know-about-other-zodiac-signs-2025-05-17-990725",
        "title": "Horoscope Today, May 18: Virgos to get better results, know about other zodiac signs",
        "content": "Today is the Udaya Tithi Panchami of Jyeshtha Krishna Paksha and Sunday. Panchami Tithi has ended at 5:58 am today. Today, Shukla Yoga will remain till 5:53 am tomorrow after crossing the whole day and night. Also, Uttarashadha Nakshatra will remain till 6:53 pm today. Apart from this, Rahu will enter Aquarius and Ketu will enter Leo at 7:35 pm today. Know from Acharya Indu Prakash how the day of May 18, 2025, will be for you and with which measures you can make this day better. Also, know what will be the lucky number and lucky colour for you.  Today is a great day for you. If there was a rift with siblings regarding something, it will go away. By giving time to the family, the atmosphere of the house will remain pleasant. Today, you will get good information related to business through your contacts. People doing government jobs can get extra responsibility. There will be pressure from the officers. Today, you can plan to go to a function. Where you can meet a distant relative. You will try to fulfil the needs of the children. Lucky colour- Black Lucky number- 1 Today, your day will be full of confidence. Today, there will be a great change in your working ability. You will maintain harmony among people with your behaviour. The advice of a close friend will prove to be very useful for you. You will achieve a lot with your energy, just trust your ability. In a difficult situation, you will easily get help from some people. Your material comforts will increase. People looking for a job will get a good job today. Lucky colour- MagentaLucky number- 9 Today will be favourable for you. Today, you will plan to watch a movie at home with the family. You will feel healthy in terms of health. If you are trying for some work today, you can achieve success. Your courage and enthusiasm will increase with the help of a special person. You can get good news through mobile and email. Today will be a good day for people associated with marketing. You will meet a childhood friend after a long time, meeting whom you will be happy. Lucky colour- PurpleLucky number- 8 Today will be a good day for you. Today, you can think of doing something big and different. Today you will be busy with family activities. Efforts to improve the financial condition will be successful. You will come into contact with influential people. Which will be beneficial for you in the coming days. You will get the support of senior officials of the office, spoiled work will be done. Today, you will also work on some new ideas. Your experience will be useful in some pending work. Lucky colour- GoldenLucky number- 2 Today will be a mixed day for you. You will get special good news from the children's side, everyone in the house will be happy. The opposition will bow down to you, your social network will become strong. Today, there will be some changes in your routine. You will get important advice from a wise person in the family. To complete your work on time, take the help of new techniques, your work will be easy. People who are fond of dance can join dance classes today. Overall, today is going to be a good day for you. Lucky colour- SilverLucky number- 7 Today will be a great day for you. You will get a full chance to express your opinion in front of the family, people will be very impressed with your plan. Today is a favourable time, but to get good results from hard work, you will have to be karma pradhan. If you have made a plan to buy or sell property today, then it can be completed. Today, there will be harmony in the family. Your financial side will be strong. You will decorate your house according to the festival. You will get the full benefit of your decision-making ability. You are getting the support and company of your spouse in abundance. Lucky colour- BlueLucky number- 2 Today, your day will be full of busyness. Today, you should avoid getting into the hassle of old things. Lovemates will understand each other's feelings and will plan to go out somewhere. Today you will meet friends. You will be happy as impossible tasks will be completed. Do not disclose personal matters to outsiders. Obstacles at work will be removed. Children will live up to your expectations today. People working in jobs should keep full focus on their work today. Lucky colour- PeachLucky number- 6 Today, your day will be full of enthusiasm. You will get success to a great extent in the work done together. You will get new advice from the elders of the house in matters of investment. Today, the work that has been pending for some time will be completed under the guidance of the elders of the house. If you are planning to buy a new vehicle, then the time is good. Today you will be busy with many types of activities. Today, your social circle will increase. Changing the place of work will change your energy. Lucky colour- GreenLucky number- 4 Today, you will get full support of luck in doing new tasks. Your spouse's advice will be beneficial in some work. Today, you will hesitate a little in taking on new responsibility. Today, there will be some changes in your routine. You will be busy with work like religion, yoga practice and will feel mental peace. The day is very good for laying the foundation of special work. There will be better coordination with your spouse. You will spend time with friends remembering old things. You will be busy with new activities with children. Lucky colour- SaffronLucky number- 5 Today, your day will be spent in busyness. The boss can entrust you with new responsibilities, which you will do with full dedication and hard work, and you will be praised for your work. New sources of income will be created for you, your financial side will be strong. There will be interest in the field of art and literature. People of this zodiac who are associated with the sports world will be busy with their practice today. Today,y you will keep getting support from parents in financial matters. Your friend can come to your house for a feast. Lucky Colour- YellowLucky Number- 3 Today will be a favourable day for you. Today, you may spend more time on daily chores. Today, it will be better for you to take the advice of elders before investing money in business. Father will try to fulfil the wishes of the children. For the people of this zodiac who want to start a new business, it will be better to do market analysis today. Today, you will get new responsibilities, which you will be able to fulfil well. People associated with the field of art will get good profits. Lucky Colour- PinkLucky Number- 8 Today will be a favourable day for you. Today, with the help of elders of the house, your important work will be completed. You will get good news from a relative. Your spouse will try to understand everything you say today, this will bring freshness in relationships. You will feel good by helping in social work. Conflicts will go away from home. You will plan to watch a movie at home with your siblings. Today you may get a chance to meet a respected person. Lucky colour- BrownLucky number- 7 (Acharya Indu Prakash is a well-known astrologer of the country, who has a long experience in Vastu, Samudrik Shastra and Jyotish Shastra. You can see him in Bhavishyavani every morning at 7:30 am on India TV.) © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-17T18:47:45+05:30"
    },
    {
        "url": "https://www.indiatvnews.com/photos/entertainment-alia-bhatt-and-kareena-kapoor-khan-actresses-who-played-journalists-on-screen-2025-05-15-990449",
        "title": "Alia Bhatt and Kareena Kapoor Khan, actresses who played journalists on screen",
        "content": "From Military Deals to Student Exchanges: How India Is Distancing Itself from Turkey Centre Picks 7 MPs, Including Tharoor And Shinde, For Global Anti-Terror Mission 13 AAP councillors resign, form new party led by Mukesh Goel | 17 May | Speed News Rajnath Singh: IAF crushed Pak-backed terrorism in just 23 minutes from Bhuj | 16 May | Speed News Taliban Turns to India: A New Diplomatic Shift in the Wake of Pakistan's Tensions? © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": ""
    },
    {
        "url": "https://www.indiatvnews.com/news/world/lashkar-e-taiba-commander-saifullah-accused-of-several-terror-attacks-in-india-killed-in-pakistan-s-sindh-province-2025-05-18-990822",
        "title": "Lashkar commander Saifullah, involved in several terror attacks in India, killed in Pakistan's Sindh province",
        "content": "Abu Saifullah Khalid, a top commander of the Pakistan-based terror group Lashkar-e-Taiba (LeT), has reportedly been killed by unidentified attackers in Pakistan's Sindh province, according to security sources. Saifullah, also known by multiple aliases, including Vinod Kumar, Mohammad Salim, Khalid, Waniyal, Wajid, and Salim Bhai, was a key figure in the LeT's operations, handling recruitment, fundraising, and cross-border infiltration.  According to officials, Khalid was gunned down while traveling through the Badin district of Sindh, where he had been leading recruitment and fundraising efforts for LeT and its parent organization, Jamaat-ud-Dawah (JuD). Local media reports from Sindh indicated that he was declared dead at a hospital following the attack, with some sources suggesting personal enmity as a possible motive, though this remains unverified. Saifullah, a close associate of top LeT commander Abu Anas, was instrumental in orchestrating several high-profile terror strikes in India. He masterminded the 2006 attack on the RSS headquarters in Nagpur, where three terrorists were shot dead by security forces before they could inflict mass casualties. He also planned the 2005 attack on the Indian Institute of Science (IISc) in Bengaluru, which left IIT professor Munish Chandra Puri dead and four others injured. In 2008, He coordinated an attack on a CRPF camp in Rampur, Uttar Pradesh, in which seven personnel and a civilian were killed, with the attackers escaping under the cover of darkness. Saifullah was known to operate a major LeT module in Nepal, facilitating the movement of terrorists into India through the porous Indo-Nepal border until Indian security agencies exposed the module, forcing him to flee to Pakistan. From the early 2000s, Khalid led LeT's Nepal module, managing recruitment, financial support, and logistical operations for the terror outfit. He worked closely with LeT's senior leaders, including Azam Cheema alias Babaji and Yaqoob, the group’s chief accountant. He was also involved in radicalisation and fundraising for both Lashkar-e-Taiba and its political front, Jamaat-ud-Dawa (JuD). In Pakistan, Khalid continued his activities, collaborating with senior LeT and JuD figures, including Yusuf Muzammil, the LeT commander for Jammu and Kashmir, Muzammil Iqbal Hashmi, and Muhammad Yusuf Taibi, to expand LeT’s operational reach. In recent years, Khalid was tasked by LeT and JuD leadership to recruit fresh cadres from Sindh’s Badin and Hyderabad districts and collect funds for the group’s operations. His killing marks a significant blow to LeT's regional operations, especially its efforts to revive cross-border terror activities through the Nepal corridor. Saifullah had reportedly married a Nepalese citizen, Nagma Banu, further cementing his operational base in the region.    © 2009-2025 Independent News Service. All rights reserved.",
        "timestamp": "2025-05-18T18:00:38+05:30"
    }
]